{
  "number": 1,
  "title": "Arjuna's Dilemma",
  "sanskrit": "अर्जुनविषादयोग",
  "verses": 47,
  "introduction": "Chapter 1 of the Bhagavad Gita, Arjuna Vishada Yoga (The Yoga of Arjuna’s Despondency), is the dramatic prelude to the entire teaching. It places us right on the battlefield of Kurukshetra, where two massive armies — cousins, teachers, uncles, friends, sons — face each other for a war that will destroy an entire civilization. Arjuna, the greatest archer of his time, asks Krishna to position the chariot between the armies so he can see clearly who he is about to fight. What he sees shatters him: every significant relationship in his life is standing on the opposing side. The chapter captures the raw, visceral moment when duty, morality, love, and horror collide so intensely that even a warrior of Arjuna’s caliber drops his legendary bow and sits down in complete despair. For modern readers, this is the chapter of every major life crisis — the moment before quitting a toxic job that pays the bills, before blowing the whistle on corruption at your company, before choosing between career ambition and family harmony, or before realizing the success you chased has come at the expense of the people you love most. Arjuna’s tears, trembling body, and final collapse are not weakness — they are the honest human response when duty and love appear irreconcilable. The entire Gita is Krishna’s answer to this one unbearable question: how can I act when every path seems to lead through the hearts of those I love? The teaching can only begin when the ego's armor has been shattered.",
  "shlokas": [
    {
      "verse": 1,
      "sanskrit": "धृतराष्ट्र उवाच |\nधर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः |\nमामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय ||",
      "transliteration": "dhṛtarāṣṭra uvāca\ndharma-kṣetre kuru-kṣetre samavetā yuyutsavaḥ\nmāmakāḥ pāṇḍavāś caiva kim akurvata sañjaya",
      "translation": "Dhritarashtra said: O Sanjaya, after my sons and the sons of Pandu assembled in the place of pilgrimage at Kurukshetra, desiring to fight, what did they do?",
      "modern": "The blind king Dhritarashtra kicks off the Gita with pure anxiety and possessive language ('my sons' vs. 'the sons of Pandu'). He’s sitting safely in the palace, glued to Sanjaya’s live commentary like a CEO obsessively checking Slack during a company crisis he helped create. This is the classic 'how’s the team doing?' from someone who refuses to see their own role in the mess. In today’s world, it’s the parent asking 'what are the kids fighting about?' while ignoring how their favoritism started the drama, or the founder asking for KPI updates while the culture is burning. The question sounds innocent, but it’s laced with fear of losing control. The entire Gita begins with delusion — perfect setup for wisdom to enter."
    },
    {
      "verse": 2,
      "sanskrit": "सञ्जय उवाच |\nदृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा |\nआचार्यमुपसङ्गम्य राजा वचनमब्रवीत् ||",
      "transliteration": "sañjaya uvāca\ndṛṣṭvā tu pāṇḍavānīkaṁ vyūḍhaṁ duryodhanas tadā\nācāryam upasaṅgamya rājā vacanam abravīt",
      "translation": "Sanjaya said: O King, after looking over the army arranged in military formation by the sons of Pandu, King Duryodhana went to his teacher and spoke the following words.",
      "modern": "Duryodhana sees the Pandava army looking sharp and organized and immediately runs to his guru Drona for a pep talk. This is peak insecure-leader energy — spotting the competition’s strong lineup and rushing to the mentor for reassurance. Think of the manager who sees a rival team’s pitch deck and calls an emergency meeting with the boss, or the student who sees classmates better prepared and panics to the professor. The fact that he goes to the teacher who trained both sides shows the tragedy: knowledge can be used for ego-protection instead of truth. Duryodhana is not assessing reality; he is seeking validation for his fear."
    },
    {
      "verse": 3,
      "sanskrit": "पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम् |\nव्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता ||",
      "transliteration": "paśyaitāṁ pāṇḍu-putrāṇām ācārya mahatīṁ camūm\nvyūḍhāṁ drupada-putreṇa tava śiṣyeṇa dhīmatā",
      "translation": "O my teacher, behold the great army of the sons of Pandu, so expertly arranged by your intelligent disciple, the son of Drupada.",
      "modern": "Duryodhana points out that the enemy army is arranged by Drona’s own brilliant student (Dhrishtadyumna). Irony level: expert. This is the sting every mentor feels when their star pupil starts a rival company and uses everything you taught them against you. In 2026 life: the ex-intern who launches a competing startup, the junior who gets promoted over you, the mentee who takes your clients. Duryodhana is trying to psych himself up by highlighting the threat, but it only exposes his insecurity. Mentorship is powerful — and risky."
    },
    {
      "verse": 4,
      "sanskrit": "अत्र शूरा महेष्वासा भीमार्जुनसमा युधि |\nयुयुधानो विराटश्च द्रुपदश्च महारथः ||",
      "transliteration": "atra śūrā maheṣvāsā bhīmārjuna-samā yudhi\nyuyudhāno virāṭaś ca drupadaś ca mahā-rathaḥ",
      "translation": "Here in this army are many heroic bowmen equal in fighting to Bhima and Arjuna: great fighters like Yuyudhana, Virata, and Drupada.",
      "modern": "Duryodhana starts listing the enemy MVPs, comparing them to his own superstars Bhima and Arjuna. This is the LinkedIn stalking session before a big pitch — 'they have MrBeast-level talent on their side.' It’s respect mixed with fear. For GenZ: seeing the rival creator’s collab list and realizing they have bigger creators. For Millennials: reading a competitor’s team page and seeing ex-colleagues who left your company. Duryodhana is doing competitor analysis, but it’s making him more nervous. Acknowledging strength is smart; letting it paralyze you is not."
    },
    {
      "verse": 5,
      "sanskrit": "धृष्टकेतुश्चेकितानः काशिराजश्च वीर्यवान् |\nपुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गवः ||",
      "transliteration": "dhṛṣṭaketuś cekitānaḥ kāśirājaś ca vīryavān\npurujit kuntibhojaś ca śaibyaś ca nara-puṅgavaḥ",
      "translation": "There are also great, heroic, powerful fighters like Dhrishtaketu, Chekitana, Kashiraja, Purujit, Kuntibhoja, and Shaibya.",
      "modern": "More name-dropping of heavy-hitters. This is scrolling through a rival company’s 'About Us' page and seeing all the awards and big names. It triggers comparison anxiety. Duryodhana is trying to hype the threat to motivate his side, but it’s backfiring — the list is getting longer and his confidence shorter. In work: realizing your competitor has both veterans and fresh GenZ talent. The lesson: know your competition, but don’t let it psych you out."
    },
    {
      "verse": 6,
      "sanskrit": "युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान् |\nसौभद्रो द्रौपदेयाश्च सर्व एव महारथाः ||",
      "transliteration": "yudhāmanyuś ca vikrānta uttamaujāś ca vīryavān\nsaubhadro draupadeyāś ca sarva eva mahā-rathaḥ",
      "translation": "There are the mighty Yudhamanyu, the very powerful Uttamauja, the son of Subhadra, and the sons of Draupadi. All these warriors are great chariot fighters.",
      "modern": "Duryodhana highlights the next-gen talent — young, fearless, rising stars. This is the boomer leader watching GenZ founders move faster, the senior exec seeing younger colleagues get promoted, the parent realizing their kids are surpassing them. The fear is not just losing the battle — it’s being left behind by time. Duryodhana’s list is now including the 'kids' — and it’s rattling him. Lesson: adapt or get disrupted."
    },
    {
      "verse": 7,
      "sanskrit": "अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम |\nनायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते ||",
      "transliteration": "asmākaṁ tu viśiṣṭā ye tān nibodha dvijottama\nnāyakā mama sainyasya saṁjñārthaṁ tān bravīmi te",
      "translation": "But for your information, O best of the brahmanas, let me tell you about the captains who are especially qualified to lead my military force.",
      "modern": "Duryodhana flips to boasting about his own team — the classic pivot after feeling threatened. This is updating your resume after seeing a job posting, or posting your squad goals on Instagram after seeing a rival group photo. It’s a defense mechanism: 'Sure, they have talent, but look at us!' Real confidence doesn’t need the counter-list. Insecure leaders do this constantly."
    },
    {
      "verse": 8,
      "sanskrit": "भवान्भीष्मश्च कर्णश्च कृपश्च समितिञ्जयः |\nअश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च ||",
      "transliteration": "bhavān bhīṣmaś ca karṇaś ca kṛpaś ca samitiñjayaḥ\naśvatthāmā vikarṇaś ca saumadattis tathaiva ca",
      "translation": "There are personalities like you, Bhishma, Karna, Kripa, Ashvatthama, Vikarna, and the son of Somadatta called Bhurishrava, who are always victorious in battle.",
      "modern": "Duryodhana names his all-stars, starting with the teacher and grandpas. This is the fantasy draft brag. For GenZ: assembling your Avengers-level group chat. For Millennials: listing your dream team in a pitch deck. The ego is inflating the list, but it highlights the importance of experienced mentors. Notice the irony: many on this list are bound by vows, not pure loyalty."
    },
    {
      "verse": 9,
      "sanskrit": "अन्ये च बहवः शूरा मदर्थे त्यक्तजीविताः |\nनानाशस्त्रप्रहरणाः सर्वे युद्धविशारदाः ||",
      "transliteration": "anye ca bahavaḥ śūrā mad-arthe tyakta-jīvitāḥ\nnānā-śastra-praharaṇāḥ sarve yuddha-viśāradāḥ",
      "translation": "There are many other heroes who are prepared to lay down their lives for my sake. All are well equipped with different kinds of weapons, and all are experienced in military science.",
      "modern": "Duryodhana boasts about ride-or-die loyal troops. This is the founder pitching to investors about their 'dedicated team' or the celeb with stans who defend them through scandals. It hints at manipulation — rallying people for personal gain. In work: leaders who demand loyalty without shared purpose. True commitment comes from mission, not fear or favors."
    },
    {
      "verse": 10,
      "sanskrit": "अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम् |\nपर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम् ||",
      "transliteration": "aparyāptaṁ tad asmākaṁ balaṁ bhīṣmābhirakṣitam\nparyāptaṁ tv idam eteṣāṁ balaṁ bhīmābhirakṣitam",
      "translation": "Our strength is immeasurable, and we are perfectly protected by Grandfather Bhishma, whereas the strength of the Pandavas, carefully protected by Bhima, is limited.",
      "modern": "Duryodhana claims superiority because of Bhishma — classic overconfidence. This is underestimating a small agile startup because your corp has 'big names.' In sports: thinking your star player guarantees the win. Hubris before the fall. The underdog often wins with better heart and strategy. Dependency on one person is a weakness."
    },
    {
      "verse": 11,
      "sanskrit": "अयनेषु च सर्वेषु यथाभागमवस्थिताः |\nभीष्ममेवाभिरक्षन्तु भवन्तः सर्व एव हि ||",
      "transliteration": "ayaneṣu ca sarveṣu yathā-bhāgam avasthitāḥ\nbhīṣmam evābhirakṣantu bhavantaḥ sarva eva hi",
      "translation": "All of you must now give full support to Grandfather Bhishma, as you stand at your respective strategic points in the phalanx of the army.",
      "modern": "Duryodhana orders everyone to protect the key asset. This is 'guard the star developer during crunch' or 'everything depends on this one product.' High-risk strategy. When the single point of failure falls, the whole thing collapses. Team coordination is good; over-dependency is dangerous."
    },
    {
      "verse": 12,
      "sanskrit": "तस्य सञ्जनयन्हर्षं कुरुवृद्धः पितामहः |\nसिंहनादं विनद्योच्चैः शङ्खं दध्मौ प्रतापवान् ||",
      "transliteration": "tasya sañjanayan harṣaṁ kuru-vṛddhaḥ pitāmahaḥ\nsiṁha-nādaṁ vinadyoccaiḥ śaṅkhaṁ dadhmau pratāpavān",
      "translation": "Then Bhishma, the great valiant grandsire of the Kuru dynasty, the grandfather of the fighters, blew his conchshell very loudly, making a sound like the roar of a lion, giving Duryodhana joy.",
      "modern": "Bhishma’s lion-roar conch is the senior leader’s hype speech after doubt creeps in. It works temporarily — like the CEO’s all-hands after bad earnings or the coach’s halftime talk when losing. Surface energy without inner alignment is short-lived. Morale boost is good; it doesn’t fix deeper misalignment."
    },
    {
      "verse": 13,
      "sanskrit": "ततः शङ्खाश्च भेर्यश्च पणवानकगोमुखाः |\nसहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत् ||",
      "transliteration": "tataḥ śaṅkhāś ca bheryaś ca paṇavānaka-gomukhāḥ\nsahasaivābhyahanyanta sa śabdas tumulo 'bhavat",
      "translation": "After that, the conchshells, drums, bugles, trumpets, and horns were all suddenly sounded, and the combined sound was tumultuous.",
      "modern": "The Kaurava side erupts in noise — the full branding rollout, viral campaign launch, or stadium chant before the big game. It’s intimidating and energizing, but noise is not victory. In organizations: the loud announcement of a new direction that masks underlying doubt. Volume ≠ substance."
    },
    {
      "verse": 14,
      "sanskrit": "ततः श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ |\nमाधवः पाण्डवश्चैव दिव्यौ शङ्खौ प्रदध्मतुः ||",
      "transliteration": "tataḥ śvetair hayair yukte mahati syandane sthitau\nmādhavaḥ pāṇḍavaś caiva divyau śaṅkhau pradadhmatuḥ",
      "translation": "On the other side, both Lord Krishna and Arjuna, stationed on a great chariot drawn by white horses, sounded their transcendental conchshells.",
      "modern": "Krishna and Arjuna counter with divine conches — the comeback tweet that goes viral or the quiet team member’s game-changing idea. Quality over quantity. Divine sound vs. mere noise. In life: the calm, clear response that cuts through chaos. Balance in rivalry — every action provokes a response."
    },
    {
      "verse": 15,
      "sanskrit": "पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः |\nपौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः ||",
      "transliteration": "pāñcajanyaṁ hṛṣīkeśo devadattaṁ dhanañjayaḥ\npauṇḍraṁ dadhmau mahā-śaṅkhaṁ bhīma-karmā vṛkodaraḥ",
      "translation": "Lord Krishna blew His conchshell, called Panchajanya; Arjuna blew his, the Devadatta; and Bhima, the voracious eater and performer of herculean tasks, blew his terrific conchshell, called Paundra.",
      "modern": "Each with signature conch — personal branding in sound form. Krishna (divine), Arjuna (victory), Bhima (terrifying power). In modern terms: the founder’s keynote voice, the product’s launch trailer sound, the team’s signature chant. Signature matters. It creates identity and presence."
    },
    {
      "verse": 16,
      "sanskrit": "अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिरः |\nनकुलः सहदेवश्च सुघोषमणिपुष्पकौ ||",
      "transliteration": "anantavijayaṁ rājā kuntī-putro yudhiṣṭhiraḥ\nnakulaḥ sahadevaś ca sughoṣa-maṇipuṣpakau",
      "translation": "King Yudhishthira, the son of Kunti, blew his conchshell, the Anantavijaya, and Nakula and Sahadeva blew the Sughosha and Manipushpaka.",
      "modern": "The king and twins join in — like a group chat blowing up with notifications. It builds collective momentum, essential for team synergy. Unity in action intimidates opponents. In life: the family backing you in a crisis or the team replying-all in support."
    },
    {
      "verse": 17,
      "sanskrit": "काश्यश्च परमेष्वासः शिखण्डी च महारथः |\nधृष्टद्युम्नो विराटश्च सात्यकिश्चापराजितः ||",
      "transliteration": "kāśyaś ca parameṣvāsaḥ śikhaṇḍī ca mahā-rathaḥ\ndhṛṣṭadyumno virāṭaś ca sātyakiś cāparājitaḥ",
      "translation": "That great archer the King of Kashi, the great fighter Shikhandi, Dhrishtadyumna, Virata, and the unconquerable Satyaki,",
      "modern": "Allies pile on the noise — like endorsements flooding a LinkedIn post. It amplifies presence, showing how networks bolster your position in negotiations or markets. Alliances strengthen your position."
    },
    {
      "verse": 18,
      "sanskrit": "द्रुपदो द्रौपदेयाश्च सर्वशः पृथिवीपते |\nसौभद्रश्च महाबाहुः शङ्खान्दध्मुः पृथक्पृथक् ||",
      "transliteration": "drupado draupadeyāś ca sarvaśaḥ pṛthivī-pate\nsaubhadraś ca mahā-bāhuḥ śaṅkhān dadhmuḥ pṛthak pṛthak",
      "translation": "Drupada, the sons of Draupadi, and the son of Subhadra, greatly armed, all blew their respective conchshells, O King.",
      "modern": "Even extended family chimes in — like a family WhatsApp group exploding. It emphasizes how personal ties strengthen alliances, but can complicate professional boundaries. Family backing is powerful but messy."
    },
    {
      "verse": 19,
      "sanskrit": "स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत् |\nनभश्च पृथिवीं चैव तुमुलोऽभ्यनुनादयन् ||",
      "transliteration": "sa ghoṣo dhārtarāṣṭrāṇāṁ hṛdayāni vyadārayat\nnabhaś ca pṛthivīṁ caiva tumulo 'bhyanunādayan",
      "translation": "The vibration of these conchshells rent the hearts of the sons of Dhritarashtra and made both heaven and earth reverberate.",
      "modern": "The Pandava noise shakes the Kauravas to the core — like a killer presentation that silences the room or a viral thread that demoralizes the opposition. Psychological warfare at its finest. Sound as a weapon — memes, chants, announcements that hit emotionally."
    },
    {
      "verse": 20,
      "sanskrit": "अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान् कपिध्वजः |\nप्रवृत्ते शस्त्रसम्पाते धनुरुद्यम्य पाण्डवः |\nहृषीकेशं तदा वाक्यमिदमाह महीपते ||",
      "transliteration": "atha vyavasthitān dṛṣṭvā dhārtarāṣṭrān kapi-dhvajaḥ\npravṛtte śastra-sampāte dhanur udyamya pāṇḍavaḥ\nhṛṣīkeśaṁ tadā vākyam idam āha mahī-pate",
      "translation": "At that time, Arjuna, the son of Pandu, seated in the chariot bearing the flag marked with Hanuman, took up his bow and prepared to shoot his arrows. O King, after looking at the sons of Dhritarashtra drawn in military array, Arjuna then spoke to Lord Krishna these words.",
      "modern": "Arjuna gears up but pauses to talk — like hesitating before hitting 'send' on a bold email or loading the app but second-guessing the post. The pause before the storm. This marks the shift from action to introspection, crucial in decision-making under pressure."
    },
    {
      "verse": 21,
      "sanskrit": "अर्जुन उवाच |\nसेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत ||",
      "transliteration": "arjuna uvāca\nsenayor ubhayor madhye rathaṁ sthāpaya me 'cyuta",
      "translation": "Arjuna said: O infallible one, please draw my chariot between the two armies so that I may see those present here, who desire to fight, and with whom I must contend in this great trial of arms.",
      "modern": "Arjuna requests a better view — like asking for a demo before committing to software or reviewing pros and cons before quitting a job. This is the moment of assessment before a big decision. Gaining perspective is essential before diving into conflicts at work or home. Arjuna chooses to look directly at the human cost — courage disguised as doubt."
    },
    {
      "verse": 22,
      "sanskrit": "यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान् |\nकैर्मया सह योद्धव्यमस्मिन्रणसमुद्यमे ||",
      "transliteration": "yāvad etān nirīkṣe 'haṁ yoddhu-kāmān avasthitān\nkair mayā saha yoddhavyam asmin raṇa-samudyame",
      "translation": "Let me see those who have come here to fight, wishing to please the evil-minded son of Dhritarashtra.",
      "modern": "Arjuna wants to assess the opposition — like reviewing a competitor’s portfolio or stalking a rival’s social media before a big move. Reconnaissance is smart strategy, but it leads to his crisis when he sees the human side. Knowing your enemies is good; seeing them as family changes everything."
    },
    {
      "verse": 23,
      "sanskrit": "योत्स्यमानानवेक्षेऽहं य एतेऽत्र समागताः |\nधार्तराष्ट्रस्य दुर्बुद्धेर्युद्धे प्रियचिकीर्षवः ||",
      "transliteration": "yotsyamānān avekṣe 'haṁ ya ete 'tra samāgatāḥ\ndhārtarāṣṭrasya durbuddher yuddhe priya-cikīrṣavaḥ",
      "translation": "Let me see those who have come here to fight, wishing to please the evil-minded son of Dhritarashtra.",
      "modern": "Arjuna questions loyalties — like wondering why colleagues side with a bad manager or why friends support a toxic leader. It probes motivations, a key insight for navigating office politics or family drama. Blind loyalty is dangerous."
    },
    {
      "verse": 24,
      "sanskrit": "सञ्जय उवाच |\nएवमुक्तो हृषीकेशो गुडाकेशेन भारत |\nसेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम् ||",
      "transliteration": "sañjaya uvāca\nevam ukto hṛṣīkeśo guḍākeśena bhārata\nsenayor ubhayor madhye sthāpayitvā rathottamam",
      "translation": "Sanjaya said: O descendant of Bharata, having thus been addressed by Arjuna, Lord Krishna drew up the fine chariot in the midst of the armies of both parties.",
      "modern": "Krishna obliges and positions the chariot for the view — like a friend driving you to confront an issue head-on. This sets the stage for revelation, much like a pivotal meeting where you finally see the full picture. Getting that front-row seat to reality can be eye-opening or overwhelming."
    },
    {
      "verse": 25,
      "sanskrit": "भीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम् |\nउवाच पार्थ पश्यैतान्समवेतान्कुरूनिति ||",
      "transliteration": "bhīṣma-droṇa-pramukhataḥ sarveṣāṁ ca mahī-kṣitām\nuvāca pārtha paśyaitān samavetān kurūn iti",
      "translation": "In the presence of Bhishma, Drona, and all the other chieftains of the world, the Lord said, Just behold, Partha, all the Kurus assembled here.",
      "modern": "Krishna urges Arjuna to look — like saying 'see for yourself' in a debate or 'face the facts' from a mentor. This is the moment of truth, forcing us to face realities in personal or professional disputes. Krishna doesn’t sugarcoat; he makes Arjuna confront the full human cost."
    },
    {
      "verse": 26,
      "sanskrit": "तत्रापश्यत्स्थितान्पार्थः पितॄनथ पितामहान् |\nआचार्यान्मातुलान्भ्रातॄन्पुत्रान्पौत्रान्सखींस्तथा ||",
      "transliteration": "tatrāpaśyat sthitān pārthaḥ pitṝn atha pitāmahān\nācāryān mātulān bhrātṝn putrān pautrān sakhīṁs tathā",
      "translation": "There Arjuna could see, within the midst of the armies of both parties, his fathers, grandfathers, teachers, maternal uncles, brothers, sons, grandsons, friends, and also his fathers-in-law and well-wishers.",
      "modern": "Arjuna sees family everywhere — like a company retreat where rivals are relatives or a family wedding turned argument. It humanizes conflict, showing how work feuds can feel personal. Conflicts aren’t abstract; they hurt people you love. This is the emotional core that makes dilemmas so painful."
    },
    {
      "verse": 27,
      "sanskrit": "श्वशुरान्सुहृदश्चैव सेनयोरुभयोरपि |\nतान्समीक्ष्य स कौन्तेयः सर्वान्बन्धूनवस्थितान् ||",
      "transliteration": "śvaśurān suhṛdaś caiva senayor ubhayor api\ntān samīkṣya sa kaunteyaḥ sarvān bandhūn avasthitān",
      "translation": "When the son of Kunti, Arjuna, saw all these different grades of friends and relatives, he became overwhelmed with compassion and spoke thus.",
      "modern": "Seeing family everywhere, Arjuna’s heart breaks — empathy overload. Like regretting a layoff decision or watching a documentary that makes you feel helpless. This shows the human side of warriors — even heroes have feelings. It’s okay to question violence or tough choices when they affect loved ones."
    },
    {
      "verse": 28,
      "sanskrit": "कृपया परयाविष्टो विषीदन्निदमब्रवीत् |\nअर्जुन उवाच |\nदृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम् ||",
      "transliteration": "kṛpayā parayāviṣṭo viṣīdann idam abravīt\narjuna uvāca\ndṛṣṭvemaṁ sva-janaṁ kṛṣṇa yuyutsuṁ samupasthitam",
      "translation": "Arjuna said: My dear Krishna, seeing my friends and relatives present before me in such a fighting spirit, I feel the limbs of my body quivering and my mouth drying up.",
      "modern": "Arjuna’s body reacts to the stress — shaking, dry mouth. This is anxiety attack city, like stage fright before a speech or nerves before a tough conversation. It normalizes mental health struggles in high-pressure situations, like exams, presentations, or confrontations. Even legends feel it. Seek help when it hits."
    },
    {
      "verse": 29,
      "sanskrit": "सीदन्ति मम गात्राणि मुखं च परिशुष्यति |\nवेपथुश्च शरीरे मे रोमहर्षश्च जायते ||",
      "transliteration": "sīdanti mama gātrāṇi mukhaṁ ca pariśuṣyati\nvepathuś ca śarīre me roma-harṣaś ca jāyate",
      "translation": "My whole body is trembling, my hair is standing on end, my bow Gandiva is slipping from my hand, and my skin is burning.",
      "modern": "Full panic mode — goosebumps, slipping bow (loss of grip on identity). This is fight-or-flight at maximum, like nerves before a date, interview, or difficult email. It’s relatable AF for anyone with anxiety. The bow slipping is symbolic — even the greatest warrior’s power fails when the heart is torn. This normalizes the physical side of emotional crises."
    },
    {
      "verse": 30,
      "sanskrit": "गाण्डीवं स्रंसते हस्तात्त्वक्चैव परिदह्यते |\nन च शक्नोम्यवस्थातुं भ्रमतीव च मे मनः ||",
      "transliteration": "gāṇḍīvaṁ sraṁsate hastāt tvak caiva paridahyate\nna ca śaknomy avasthātuṁ bhramatīva ca me manaḥ",
      "translation": "I am now unable to stand here any longer. I am forgetting myself, and my mind is reeling. I see only causes of misfortune, O Krishna, killer of the Keshi demon.",
      "modern": "Mind spinning with doom — like a bad performance review spiral or bad news piling up. Arjuna can’t stand steady, seeing only bad omens. This captures depression in crisis, reminding us to pause and breathe before decisions. The mind reels when values clash with action."
    },
    {
      "verse": 31,
      "sanskrit": "निमित्तानि च पश्यामि विपरीतानि केशव |\nन च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे ||",
      "transliteration": "nimittāni ca paśyāmi viparītāni keśava\nna ca śreyo 'nupaśyāmi hatvā sva-janam āhave",
      "translation": "I do not see how any good can come from killing my own kinsmen in this battle, nor can I, my dear Krishna, desire any subsequent victory, kingdom, or happiness.",
      "modern": "Arjuna questions the win’s worth — like a promotion that costs friendships or success that destroys family. This challenges ambition: is success worth destroying relationships? Deep for career-driven folks in hustle culture. Victory without heart is hollow."
    },
    {
      "verse": 32,
      "sanskrit": "न काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च |\nकिं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा ||",
      "transliteration": "na kāṅkṣe vijayaṁ kṛṣṇa na ca rājyaṁ sukhāni ca\nkiṁ no rājyena govinda kiṁ bhogair jīvitena vā",
      "translation": "O Govinda, of what avail to us are a kingdom, happiness or even life itself when all those for whom we may desire them are now arrayed on this battlefield?",
      "modern": "Arjuna’s like 'I don’t want the win, kingdom, or happiness if it costs this.' This is anti-materialism vibe. Like realizing money can’t buy family peace or that career success feels empty without loved ones. In hustle culture, it’s a reminder to prioritize people over possessions or power."
    },
    {
      "verse": 33,
      "sanskrit": "येषामर्थे काङ्क्षितं नो राज्यं भोगाः सुखानि च |\nत इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च ||",
      "transliteration": "yeṣām arthe kāṅkṣitaṁ no rājyaṁ bhogāḥ sukhāni ca\nta ime 'vasthitā yuddhe prāṇāṁs tyaktvā dhanāni ca",
      "translation": "O Madhusudana, when teachers, fathers, sons, grandfathers, maternal uncles, fathers-in-law, grandsons, brothers-in-law and other relatives are ready to give up their lives and properties and are standing before me, why should I wish to kill them, even though they might otherwise kill me?",
      "modern": "Why fight those we love? — like office rivals who are also friends or family arguments over money. It challenges the cost of competition in close-knit teams. Self-defense is one thing; destroying loved ones is another. This questions if retaliation is worth it in road rage, online trolls, or family feuds."
    },
    {
      "verse": 34,
      "sanskrit": "आचार्याः पितरः पुत्रास्तथैव च पितामहाः |\nमातुलाः श्वशुराः पौत्राः श्यालाः सम्बन्धिनस्तथा ||",
      "transliteration": "ācāryāḥ pitaraḥ putrās tathaiva ca pitāmahāḥ\nmātulāḥ śvaśurāḥ pautrāḥ śyālāḥ sambandhinas tathā",
      "translation": "Teachers, fathers, sons, grandfathers, maternal uncles, fathers-in-law, grandsons, brothers-in-law and all relatives,",
      "modern": "Listing the bonds — like a family org chart or tagging everyone in a group photo. It drives home interconnectedness, like in social networks where one fight affects the whole circle. Conflicts ripple through networks, affecting work-life balance. Family and friends are not abstract — they are the reason for living."
    },
    {
      "verse": 35,
      "sanskrit": "एतान्न हन्तुमिच्छामि घ्नतोऽपि मधुसूदन |\nअपि त्रैलोक्यराज्यस्य हेतोः किं नु महीकृते ||",
      "transliteration": "etān na hantum icchāmi ghnato 'pi madhusūdana\napi trailokya-rājyasya hetoḥ kiṁ nu mahī-kṛte",
      "translation": "O maintainer of all living entities, I am not prepared to fight with them even in exchange for the three worlds, let alone this earth. What pleasure will we derive from killing the sons of Dhritarashtra?",
      "modern": "Arjuna wouldn’t kill them even for the universe — like declining a dream job if it means betraying friends or family. This is a stand for principles over profits. In career: turning down a lucrative deal with shady ethics. Values over gains. The ultimate refusal."
    },
    {
      "verse": 36,
      "sanskrit": "निहत्य धार्तराष्ट्रान्नः का प्रीतिः स्याज्जनार्दन |\nपापमेवाश्रयेदस्मान्हत्वैतानाततायिनः ||",
      "transliteration": "nihatya dhārtarāṣṭrān naḥ kā prītiḥ syāj janārdana\npāpam evāśrayed asmān hatvaitān ātatāyinaḥ",
      "translation": "Sin will overcome us if we slay such aggressors. Therefore it is not proper for us to kill the sons of Dhritarashtra and our friends. What should we gain, O Krishna, husband of the goddess of fortune, and how could we be happy by killing our own kinsmen?",
      "modern": "Killing them would bring sin, not joy — like regretting a revenge prank or winning dirty in business. This questions if ends justify means, like in activism or business — is winning dirty worth the guilt? Victory tainted by sin is no victory."
    },
    {
      "verse": 37,
      "sanskrit": "यद्यप्येते न पश्यन्ति लोभोपहतचेतसः |\nकुलक्षयकृतं दोषं मित्रद्रोहे च पातकम् ||",
      "transliteration": "yady apy ete na paśyanti lobhopahata-cetasaḥ\nkula-kṣaya-kṛtaṁ doṣaṁ mitra-drohe ca pātakam",
      "translation": "O Janardana, although these men, their hearts overtaken by greed, see no fault in killing one's family or quarreling with friends,",
      "modern": "The enemies are blinded by greed, not seeing the wrong — like execs ignoring ethics for bonuses or politicians for power. This critiques short-sighted ambition in corporate culture or consumerism. Greed blinds; wisdom sees the long-term damage to relationships and society."
    },
    {
      "verse": 38,
      "sanskrit": "कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम् |\nकुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन ||",
      "transliteration": "kathaṁ na jñeyam asmābhiḥ pāpād asmān nivartitum\nkula-kṣaya-kṛtaṁ doṣaṁ prapaśyadbhir janārdana",
      "translation": "Why should we, who can see the crime in destroying a family, engage in these acts of sin, O Krishna?",
      "modern": "Why join the folly? — like refusing to partake in toxic workplace behavior or gossip. This encourages moral courage: standing against wrong even if others don’t. Seeing the crime and still participating is the real sin. Be the one who says no."
    },
    {
      "verse": 39,
      "sanskrit": "कुलक्षये प्रणश्यन्ति कुलधर्माः सनातनाः |\nधर्मे नष्टे कुलं कृत्स्नमधर्मोऽभिभवत्युत ||",
      "transliteration": "kula-kṣaye praṇaśyanti kula-dharmāḥ sanātanāḥ\ndharme naṣṭe kulaṁ kṛtsnam adharmo 'bhibhavaty uta",
      "translation": "With the destruction of the dynasty, the eternal family tradition is vanquished, and thus the rest of the family becomes involved in irreligion.",
      "modern": "Destroying family leads to loss of traditions and rise of chaos — like how divorces or family feuds affect kids’ values or how corporate scandals tarnish culture. This warns of long-term effects of conflicts, like in wars, family feuds, or office politics today. Protect the ecosystem."
    },
    {
      "verse": 40,
      "sanskrit": "अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रियः |\nस्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसङ्करः ||",
      "transliteration": "adharmābhibhavāt kṛṣṇa praduṣyanti kula-striyaḥ\nstrīṣu duṣṭāsu vārṣṇeya jāyate varṇa-saṅkaraḥ",
      "translation": "When irreligion is prominent in the family, O Krishna, the women of the family become polluted, and from the degradation of womanhood, O descendant of Vrishni, comes unwanted progeny.",
      "modern": "Chaos leads to moral decline, especially affecting women and future generations — like how wars or poverty lead to societal issues or how toxic workplaces affect families. This highlights protecting vulnerable groups in crises. When values erode, the next generation suffers."
    },
    {
      "verse": 41,
      "sanskrit": "सङ्करो नरकायैव कुलघ्नानां कुलस्य च |\nपतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रियाः ||",
      "transliteration": "saṅkaro narakāyaiva kula-ghnānāṁ kulasya ca\npatanti pitaro hy eṣāṁ lupta-piṇḍodaka-kriyāḥ",
      "translation": "An increase of unwanted children certainly causes hellish life for both the family and those who destroy the family. The ancestors of such corrupt families fall down, because the performances for offering them food and water are entirely stopped.",
      "modern": "Bad progeny leads to hell for everyone; ancestors suffer too — like how trauma passes down families or bad decisions haunt successors in family businesses. This encourages thinking long-term, like climate action for future kids or ethical business for legacy. Generational impact is real."
    },
    {
      "verse": 42,
      "sanskrit": "दोषैरेतैः कुलघ्नानां वर्णसङ्करकारकैः |\nउत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः ||",
      "transliteration": "doṣair etaiḥ kula-ghnānāṁ varṇa-saṅkara-kārakaiḥ\nutsādyante jāti-dharmāḥ kula-dharmāś ca śāśvatāḥ",
      "translation": "By the evil deeds of those who destroy the family tradition and thus give rise to unwanted children, all kinds of community projects and family welfare activities are devastated.",
      "modern": "Societal norms crumble — like a viral scandal eroding trust in institutions or corruption destroying community projects. This calls for preserving culture and community in a globalized world. When family values collapse, society suffers."
    },
    {
      "verse": 43,
      "sanskrit": "उत्सन्नकुलधर्माणां मनुष्याणां जनार्दन |\nनरके नियतं वासो भवतीत्यनुशुश्रुम ||",
      "transliteration": "utsanna-kula-dharmāṇāṁ manuṣyāṇāṁ janārdana\nnarake niyataṁ vāso bhavatīty anuśuśruma",
      "translation": "O Krishna, maintainer of the people, I have heard by disciplic succession that those whose family traditions are destroyed dwell always in hell.",
      "modern": "Arjuna recalls teachings that such destruction leads to hell — like grandma’s warnings about bad choices or elder advice in mentorship programs. This shows respect for tradition, but also questions if it’s always right. Ancestral wisdom is valuable; blind adherence is not."
    },
    {
      "verse": 44,
      "sanskrit": "अहो बत महत्पापं कर्तुं व्यवसिता वयम् |\nयद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः ||",
      "transliteration": "aho bata mahat pāpaṁ kartuṁ vyavasitā vayam\nyad rājya-sukha-lobhena hantuṁ sva-janam udyatāḥ",
      "translation": "Alas, how strange it is that we are preparing to commit greatly sinful acts. Driven by the desire to enjoy royal happiness, we are intent on killing our own kinsmen.",
      "modern": "Arjuna laments the irony of sinning for pleasure — like chasing KPIs at the expense of team morale or revenge that hurts everyone. This calls out hypocrisy in pursuits of fame or wealth at others’ expense. Greed makes us do things we know are wrong."
    },
    {
      "verse": 45,
      "sanskrit": "यदि मामप्रतीकारमशस्त्रं शस्त्रपाणयः |\nधार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत् ||",
      "transliteration": "yadi mām apratīkāram aśastraṁ śastra-pāṇayaḥ\ndhārtarāṣṭrā raṇe hanyus tan me kṣemataram bhavet",
      "translation": "Better for me if the sons of Dhritarashtra, weapons in hand, were to kill me unarmed and unresisting on the battlefield.",
      "modern": "Arjuna prefers to die unarmed than fight — like walking away from a toxic argument or choosing peace over retaliation in protests. This inspires non-violent resolution in conflicts. Sometimes the bravest thing is to drop the weapons and stand for peace."
    },
    {
      "verse": 46,
      "sanskrit": "सञ्जय उवाच |\nएवमुक्त्वार्जुनः सङ्ख्ये रथोपस्थ उपाविशत् |\nविसृज्य सशरं चापं शोकसंविग्नमानसः ||",
      "transliteration": "sañjaya uvāca\nevam uktvārjunaḥ saṅkhye rathopastha upāviśat\nvisṛjya sa-śaraṁ cāpaṁ śoka-saṁvigna-mānasaḥ",
      "translation": "Sanjaya said: Arjuna, having thus spoken on the battlefield, cast aside his bow and arrows and sat down on the chariot, his mind overwhelmed with grief.",
      "modern": "Arjuna drops his weapons and sits down, overwhelmed — like hitting burnout wall or quitting mid-game. This ends the chapter on a cliffhanger, setting up for Krishna’s guidance — like calling a timeout when life’s too much. Vulnerability precedes growth. Rock bottom is the launchpad."
    },
    {
      "verse": 47,
      "sanskrit": "ॐ तत्सदिति श्रीमद्भगवद्गीतासूपनिषत्सु ब्रह्मविद्यायां योगशास्त्रे श्रीकृष्णार्जुनसंवादे अर्जुनविषादयोगो नाम प्रथमोऽध्यायः ||",
      "transliteration": "oṁ tat sad iti śrīmad bhagavad-gītāsu upaniṣatsu brahma-vidyāyāṁ yoga-śāstre śrī-kṛṣṇārjuna-saṁvāde arjuna-viṣāda-yogo nāma prathamo 'dhyāyaḥ",
      "translation": "Thus ends Chapter 1 of the Bhagavad Gita, entitled 'Arjuna Vishada Yoga.'",
      "modern": "The chapter wraps with the colophon. Reflecting on Arjuna’s grief, it’s a reminder that doubt is the start of wisdom — like hitting rock bottom before a glow-up or the dark night of the soul before breakthrough. Perfect setup for the Gita’s life hacks. The dilemma is universal; the solution is coming."
    }
  ]
}
