"number": 1,
"title": "Arjuna Vishada Yoga",
"sanskrit": "अर्जुनविषादयोग",
"verses": 47,
"introduction": "Chapter 1 of the Bhagavad Gita unfolds on the battlefield of Kurukshetra, where the Pandavas and Kauravas face off in a family feud turned epic war. Arjuna, the skilled archer, experiences a profound crisis of conscience upon seeing his loved ones arrayed against him. This chapter captures the internal conflict between duty and emotion, much like modern dilemmas where professional obligations clash with personal relationships—think navigating office politics with colleagues who feel like family, or deciding whether to pursue a promotion that might strain ties at home. It's the raw, human setup for Krishna's timeless guidance on life, work, and purpose.",
"shlokas": [
{
"verse": 1,
"sanskrit": "धृतराष्ट्र उवाच |\nधर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः |\nमामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय ||",
"transliteration": "dhṛtarāṣṭra uvāca\ndharma-kṣetre kuru-kṣetre samavetā yuyutsavaḥ\nmāmakāḥ pāṇḍavāś caiva kim akurvata sañjaya",
"translation": "Dhritarashtra said: O Sanjaya, after my sons and the sons of Pandu assembled in the place of pilgrimage at Kurukshetra, desiring to fight, what did they do?",
"modern": "The blind king Dhritarashtra is glued to the updates from Sanjaya, like a CEO anxiously awaiting reports from a high-stakes merger gone wrong. It's that mix of curiosity and dread—similar to checking your email inbox after a heated team meeting, wondering how the office rivalry will play out. In essence, it highlights how leaders often stay in the dark about the real human costs of their ambitions."
},
{
"verse": 2,
"sanskrit": "सञ्जय उवाच |\nदृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा |\nआचार्यमुपसङ्गम्य राजा वचनमब्रवीत् ||",
"transliteration": "sañjaya uvāca\ndṛṣṭvā tu pāṇḍavānīkaṁ vyūḍhaṁ duryodhanas tadā\nācāryam upasaṅgamya rājā vacanam abravīt",
"translation": "Sanjaya said: O King, after looking over the army arranged in military formation by the sons of Pandu, King Duryodhana went to his teacher and spoke the following words.",
"modern": "Duryodhana spots the enemy lineup and immediately consults his mentor Drona—think of it as a project manager panicking over a competitor's pitch and rushing to the boss for reassurance. It's a reminder that even the most confident leaders have moments of doubt, especially when the opposition looks sharper than expected, much like sizing up a rival team during a corporate bid."
},
{
"verse": 3,
"sanskrit": "पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम् |\nव्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता ||",
"transliteration": "paśyaitāṁ pāṇḍu-putrāṇām ācārya mahatīṁ camūm\nvyūḍhāṁ drupada-putreṇa tava śiṣyeṇa dhīmatā",
"translation": "O my teacher, behold the great army of the sons of Pandu, so expertly arranged by your intelligent disciple, the son of Drupada.",
"modern": "Duryodhana points out the formidable enemy formation led by Drona's own student—ironic, right? It's like when your ex-intern launches a startup that outmaneuvers your company. This verse underscores the double-edged sword of mentorship: the skills you impart might come back to challenge you in the professional arena."
},
{
"verse": 4,
"sanskrit": "अत्र शूरा महेष्वासा भीमार्जुनसमा युधि |\nयुयुधानो विराटश्च द्रुपदश्च महारथः ||",
"transliteration": "atra śūrā maheṣvāsā bhīmārjuna-samā yudhi\nyuyudhāno virāṭaś ca drupadaś ca mahā-rathaḥ",
"translation": "Here in this army are many heroic bowmen equal in fighting to Bhima and Arjuna: great fighters like Yuyudhana, Virata, and Drupada.",
"modern": "Duryodhana lists the enemy MVPs, equating them to heavyweights like Bhima and Arjuna. Imagine scouting a job applicant's LinkedIn and seeing endorsements from industry giants—intimidating, but it forces you to up your game. Seriously, it's a call to recognize talent on all sides in any competition, whether in war or the workplace."
},
{
"verse": 5,
"sanskrit": "धृष्टकेतुश्चेकितानः काशिराजश्च वीर्यवान् |\nपुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गवः ||",
"transliteration": "dhṛṣṭaketuś cekitānaḥ kāśirājaś ca vīryavān\npurujit kuntibhojaś ca śaibyaś ca nara-puṅgavaḥ",
"translation": "There are also great, heroic, powerful fighters like Dhrishtaketu, Chekitana, Kashiraja, Purujit, Kuntibhoja, and Shaibya.",
"modern": "More heavy-hitters on the list—it's like reading a conference speaker lineup stacked with experts. In work life, this is akin to facing a negotiation table full of seasoned pros; funny how it makes you question your own prep, but it's a nudge to build your own strong network."
},
{
"verse": 6,
"sanskrit": "युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान् |\nसौभद्रो द्रौपदेयाश्च सर्व एव महारथाः ||",
"transliteration": "yudhāmanyuś ca vikrānta uttamaujāś ca vīryavān\nsaubhadro draupadeyāś ca sarva eva mahā-rathāḥ",
"translation": "There are the mighty Yudhamanyu, the very powerful Uttamauja, the son of Subhadra, and the sons of Draupadi. All these warriors are great chariot fighters.",
"modern": "Including the next-gen warriors—think millennials and GenZ disrupting the old guard in tech. It's humorous how legacy players like Duryodhana get rattled by fresh talent, but it teaches us to adapt or get left behind in evolving industries."
},
{
"verse": 7,
"sanskrit": "अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम |\nनायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते ||",
"transliteration": "asmākaṁ tu viśiṣṭā ye tān nibodha dvijottama\nnāyakā mama sainyasya saṁjñārthaṁ tān bravīmi te",
"translation": "But for your information, O best of the brahmanas, let me tell you about the captains who are especially qualified to lead my military force.",
"modern": "Duryodhana shifts to boasting about his own team—like updating your resume after seeing a job posting. It's a classic defense mechanism in competitive environments, reminding us that self-assessment is key, even if it's a bit overconfident."
},
{
"verse": 8,
"sanskrit": "भवान्भीष्मश्च कर्णश्च कृपश्च समितिञ्जयः |\nअश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च ||",
"transliteration": "bhavān bhīṣmaś ca karṇaś ca kṛpaś ca samitiñjayaḥ\naśvatthāmā vikarṇaś ca saumadattis tathaiva ca",
"translation": "There are personalities like you, Bhishma, Karna, Kripa, Ashvatthama, Vikarna, and the son of Somadatta called Bhurishrava, who are always victorious in battle.",
"modern": "Naming his all-stars, starting with veterans—akin to a fantasy sports draft pick. Funny how ego inflates the list, but it highlights the importance of experienced mentors in guiding teams through tough projects."
},
{
"verse": 9,
"sanskrit": "अन्ये च बहवः शूरा मदर्थे त्यक्तजीविताः |\nनानाशस्त्रप्रहरणाः सर्वे युद्धविशारदाः ||",
"transliteration": "anye ca bahavaḥ śūrā mad-arthe tyakta-jīvitāḥ\nnānā-śastra-praharaṇāḥ sarve yuddha-viśāradāḥ",
"translation": "There are many other heroes who are prepared to lay down their lives for my sake. All are well equipped with different kinds of weapons, and all are experienced in military science.",
"modern": "Boasting about loyal followers ready to go all-in—like a startup founder's pitch to investors about their dedicated team. It's a bit cultish, but it raises questions about true loyalty versus manipulation in leadership roles."
},
{
"verse": 10,
"sanskrit": "अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम् |\nपर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम् ||",
"transliteration": "aparyāptaṁ tad asmākaṁ balaṁ bhīṣmābhirakṣitam\nparyāptaṁ tv idam eteṣāṁ balaṁ bhīmābhirakṣitam",
"translation": "Our strength is immeasurable, and we are perfectly protected by Grandfather Bhishma, whereas the strength of the Pandavas, carefully protected by Bhima, is limited.",
"modern": "Duryodhana claims superiority thanks to Bhishma—overconfidence much? Like underestimating a small agile team because your corp has big names. Lesson: Numbers aren't everything; strategy wins wars and boardrooms."
},
{
"verse": 11,
"sanskrit": "अयनेषु च सर्वेषु यथाभागमवस्थिताः |\nभीष्ममेवाभिरक्षन्तु भवन्तः सर्व एव हि ||",
"transliteration": "ayaneṣu ca sarveṣu yathā-bhāgam avasthitāḥ\nbhīṣmam evābhirakṣantu bhavantaḥ sarva eva hi",
"translation": "All of you must now give full support to Grandfather Bhishma, as you stand at your respective strategic points in the phalanx of the army.",
"modern": "Orders to protect the key player—think safeguarding your star developer during a crunch. Humorous dependency on one person, but it stresses team coordination in high-pressure work scenarios."
},
{
"verse": 12,
"sanskrit": "तस्य सञ्जनयन्हर्षं कुरुवृद्धः पितामहः |\nसिंहनादं विनद्योच्चैः शङ्खं दध्मौ प्रतापवान् ||",
"transliteration": "tasya sañjanayan harṣaṁ kuru-vṛddhaḥ pitāmahaḥ\nsiṁha-nādaṁ vinadyoccaiḥ śaṅkhaṁ dadhmau pratāpavān",
"translation": "Then Bhishma, the great valiant grandsire of the Kuru dynasty, the grandfather of the fighters, blew his conchshell very loudly, making a sound like the roar of a lion, giving Duryodhana joy.",
"modern": "Bhishma's lion-like conch blow boosts morale—like a motivational speech from a seasoned exec. It's that energy kick before a deadline, showing how small acts can rally a team."
},
{
"verse": 13,
"sanskrit": "ततः शङ्खाश्च भेर्यश्च पणवानकगोमुखाः |\nसहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत् ||",
"transliteration": "tataḥ śaṅkhāś ca bheryaś ca paṇavānaka-gomukhāḥ\nsahasaivābhyahanyanta sa śabdas tumulo 'bhavat",
"translation": "After that, the conchshells, drums, bugles, trumpets, and horns were all suddenly sounded, and the combined sound was tumultuous.",
"modern": "The Kaurava side erupts in noise—imagine the chaos of a stock market opening bell on steroids. It captures the adrenaline of launch days, where excitement meets overwhelming pressure."
},
{
"verse": 14,
"sanskrit": "ततः श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ |\nमाधवः पाण्डवश्चैव दिव्यौ शङ्खौ प्रदध्मतुः ||",
"transliteration": "tataḥ śvetair hayair yukte mahati syandane sthitau\nmādhavaḥ pāṇḍavaś caiva divyau śaṅkhau pradadhmatuḥ",
"translation": "On the other side, both Lord Krishna and Arjuna, stationed on a great chariot drawn by white horses, sounded their transcendental conchshells.",
"modern": "Krishna and Arjuna counter with their conches—like a comeback tweet that goes viral. It shows balance in rivalry, reminding us that every action in business or life provokes a response."
},
{
"verse": 15,
"sanskrit": "पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः |\nपौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः ||",
"transliteration": "pāñcajanyaṁ hṛṣīkeśo devadattaṁ dhanañjayaḥ\npauṇḍraṁ dadhmau mahā-śaṅkhaṁ bhīma-karmā vṛkodaraḥ",
"translation": "Lord Krishna blew His conchshell, called Panchajanya; Arjuna blew his, the Devadatta; and Bhima, the voracious eater and performer of herculean tasks, blew his terrific conchshell, called Paundra.",
"modern": "Each with their signature conch—personal branding at its ancient best. Like customizing your Slack status; it adds flair, but seriously, it unites the team in a show of strength."
},
{
"verse": 16,
"sanskrit": "अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिरः |\nनकुलः सहदेवश्च सुघोषमणिपुष्पकौ ||",
"transliteration": "anantavijayaṁ rājā kuntī-putro yudhiṣṭhiraḥ\nnakulaḥ sahadevaś ca sughoṣa-maṇipuṣpakau",
"translation": "King Yudhishthira, the son of Kunti, blew his conchshell, the Anantavijaya, and Nakula and Sahadeva blew the Sughosha and Manipushpaka.",
"modern": "The king and twins join in—like a group email chain where everyone replies all. It builds collective momentum, essential for team synergy in collaborative projects."
},
{
"verse": 17,
"sanskrit": "काश्यश्च परमेष्वासः शिखण्डी च महारथः |\nधृष्टद्युम्नो विराटश्च सात्यकिश्चापराजितः ||",
"transliteration": "kāśyaś ca parameṣvāsaḥ śikhaṇḍī ca mahā-rathaḥ\ndhṛṣṭadyumno virāṭaś ca sātyakiś cāparājitaḥ",
"translation": "That great archer the King of Kashi, the great fighter Shikhandi, Dhrishtadyumna, Virata, and the unconquerable Satyaki,",
"modern": "Allies pile on the noise—like endorsements flooding a LinkedIn post. It amplifies presence, showing how networks bolster your position in negotiations or markets."
},
{
"verse": 18,
"sanskrit": "द्रुपदो द्रौपदेयाश्च सर्वशः पृथिवीपते |\nसौभद्रश्च महाबाहुः शङ्खान्दध्मुः पृथक्पृथक् ||",
"transliteration": "drupado draupadeyāś ca sarvaśaḥ pṛthivī-pate\nsaubhadraś ca mahā-bāhuḥ śaṅkhān dadhmuḥ pṛthak pṛthak",
"translation": "Drupada, the sons of Draupadi, and the son of Subhadra, greatly armed, all blew their respective conchshells, O King.",
"modern": "Even extended family chimes in—like a family WhatsApp group exploding. It emphasizes how personal ties strengthen alliances, but can complicate professional boundaries."
},
{
"verse": 19,
"sanskrit": "स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत् |\nनभश्च पृथिवीं चैव तुमुलोऽभ्यनुनादयन् ||",
"transliteration": "sa ghoṣo dhārtarāṣṭrāṇāṁ hṛdayāni vyadārayat\nnabhaś ca pṛthivīṁ caiva tumulo 'bhyanunādayan",
"translation": "The vibration of these conchshells rent the hearts of the sons of Dhritarashtra and made both heaven and earth reverberate.",
"modern": "The sound pierces the enemy—like a killer presentation that silences the room. It's psychological warfare, akin to a well-timed market disruption that shakes competitors."
},
{
"verse": 20,
"sanskrit": "अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान् कपिध्वजः |\nप्रवृत्ते शस्त्रसम्पाते धनुरुद्यम्य पाण्डवः |\nहृषीकेशं तदा वाक्यमिदमाह महीपते ||",
"transliteration": "atha vyavasthitān dṛṣṭvā dhārtarāṣṭrān kapi-dhvajaḥ\npravṛtte śastra-sampāte dhanur udyamya pāṇḍavaḥ\nhṛṣīkeśaṁ tadā vākyam idam āha mahī-pate",
"translation": "At that time, Arjuna, the son of Pandu, seated in the chariot bearing the flag marked with Hanuman, took up his bow and prepared to shoot his arrows. O King, after looking at the sons of Dhritarashtra drawn in military array, Arjuna then spoke to Lord Krishna these words.",
"modern": "Arjuna gears up but pauses to talk—like hesitating before hitting 'send' on a bold email. It marks the shift from action to introspection, crucial in decision-making under pressure."
},
{
"verse": 21,
"sanskrit": "अर्जुन उवाच |\nसेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत ||",
"transliteration": "arjuna uvāca\nsenayor ubhayor madhye rathaṁ sthāpaya me 'cyuta",
"translation": "Arjuna said: O infallible one, please draw my chariot between the two armies so that I may see those present here, who desire to fight, and with whom I must contend in this great trial of arms.",
"modern": "Arjuna requests a better view—like asking for a demo before committing to software. It's about gaining perspective, essential before diving into conflicts at work or home."
},
{
"verse": 22,
"sanskrit": "यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान् |\nकैर्मया सह योद्धव्यमस्मिन्रणसमुद्यमे ||",
"transliteration": "yāvad etān nirīkṣe 'haṁ yoddhu-kāmān avasthitān\nkair mayā saha yoddhavyam asmin raṇa-samudyame",
"translation": "Let me see those who have come here to fight, wishing to please the evil-minded son of Dhritarashtra.",
"modern": "He wants to assess the opposition—like reviewing a competitor's portfolio. Funny how reconnaissance can lead to doubt, but it's smart strategy in any rivalry."
},
{
"verse": 23,
"sanskrit": "योत्स्यमानानवेक्षेऽहं य एतेऽत्र समागताः |\nधार्तराष्ट्रस्य दुर्बुद्धेर्युद्धे प्रियचिकीर्षवः ||",
"transliteration": "yotsyamānān avekṣe 'haṁ ya ete 'tra samāgatāḥ\ndhārtarāṣṭrasya durbuddher yuddhe priya-cikīrṣavaḥ",
"translation": "Let me see those who have come here to fight, wishing to please the evil-minded son of Dhritarashtra.",
"modern": "Questioning loyalties—like wondering why colleagues side with a bad manager. It probes motivations, a key insight for navigating office politics."
},
{
"verse": 24,
"sanskrit": "सञ्जय उवाच |\nएवमुक्तो हृषीकेशो गुडाकेशेन भारत |\nसेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम् ||",
"transliteration": "sañjaya uvāca\nevam ukto hṛṣīkeśo guḍākeśena bhārata\nsenayor ubhayor madhye sthāpayitvā rathottamam",
"translation": "Sanjaya said: O descendant of Bharata, having thus been addressed by Arjuna, Lord Krishna drew up the fine chariot in the midst of the armies of both parties.",
"modern": "Krishna obliges, positioning for the view—like a friend driving you to confront an issue. It sets the stage for revelation, much like a pivotal meeting."
},
{
"verse": 25,
"sanskrit": "भीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम् |\nउवाच पार्थ पश्यैतान्समवेतान्कुरूनिति ||",
"transliteration": "bhīṣma-droṇa-pramukhataḥ sarveṣāṁ ca mahī-kṣitām\nuvāca pārtha paśyaitān samavetān kurūn iti",
"translation": "In the presence of Bhishma, Drona, and all the other chieftains of the world, the Lord said, Just behold, Partha, all the Kurus assembled here.",
"modern": "Krishna urges Arjuna to look—like saying 'see for yourself' in a debate. It's that moment of truth, forcing us to face realities in personal or professional disputes."
},
{
"verse": 26,
"sanskrit": "तत्रापश्यत्स्थितान्पार्थः पितॄनथ पितामहान् |\nआचार्यान्मातुलान्भ्रातॄन्पुत्रान्पौत्रान्सखींस्तथा ||",
"transliteration": "tatrāpaśyat sthitān pārthaḥ pitṝn atha pitāmahān\nācāryān mātulān bhrātṝn putrān pautrān sakhīṁs tathā",
"translation": "There Arjuna could see, within the midst of the armies of both parties, his fathers, grandfathers, teachers, maternal uncles, brothers, sons, grandsons, friends, and also his fathers-in-law and well-wishers.",
"modern": "Arjuna sees family everywhere—like a company retreat where rivals are relatives. It humanizes conflict, showing how work feuds can feel personal."
},
{
"verse": 27,
"sanskrit": "श्वशुरान्सुहृदश्चैव सेनयोरुभयोरपि |\nतान्समीक्ष्य स कौन्तेयः सर्वान्बन्धूनवस्थितान् ||",
"transliteration": "śvaśurān suhṛdaś caiva senayor ubhayor api\ntān samīkṣya sa kaunteyaḥ sarvān bandhūn avasthitān",
"translation": "When the son of Kunti, Arjuna, saw all these different grades of friends and relatives, he became overwhelmed with compassion and spoke thus.",
"modern": "Overwhelmed by seeing kin—empathy hits hard, like regretting a layoff decision. It teaches that compassion in leadership can prevent rash actions."
},
{
"verse": 28,
"sanskrit": "कृपया परयाविष्टो विषीदन्निदमब्रवीत् |\nअर्जुन उवाच |\nदृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम् ||",
"transliteration": "kṛpayā parayāviṣṭo viṣīdann idam abravīt\narjuna uvāca\ndṛṣṭvemaṁ sva-janaṁ kṛṣṇa yuyutsuṁ samupasthitam",
"translation": "Arjuna said: My dear Krishna, seeing my friends and relatives present before me in such a fighting spirit, I feel the limbs of my body quivering and my mouth drying up.",
"modern": "Arjuna's physical symptoms kick in—like pre-meeting jitters. It's a serious nod to stress management, with a funny twist: even heroes get butterflies."
},
{
"verse": 29,
"sanskrit": "सीदन्ति मम गात्राणि मुखं च परिशुष्यति |\nवेपथुश्च शरीरे मे रोमहर्षश्च जायते ||",
"transliteration": "sīdanti mama gātrāṇi mukhaṁ ca pariśuṣyati\nvepathuś ca śarīre me roma-harṣaś ca jāyate",
"translation": "My whole body is trembling, my hair is standing on end, my bow Gandiva is slipping from my hand, and my skin is burning.",
"modern": "Full panic mode—like bombing a presentation. It normalizes anxiety, urging us to address mental health in demanding jobs."
},
{
"verse": 30,
"sanskrit": "गाण्डीवं स्रंसते हस्तात्त्वक्चैव परिदह्यते |\nन च शक्नोम्यवस्थातुं भ्रमतीव च मे मनः ||",
"transliteration": "gāṇḍīvaṁ sraṁsate hastāt tvak caiva paridahyate\nna ca śaknomy avasthātuṁ bhramatīva ca me manaḥ",
"translation": "I am now unable to stand here any longer. I am forgetting myself, and my mind is reeling. I see only causes of misfortune, O Krishna, killer of the Keshi demon.",
"modern": "Mind spinning with doom—like a bad performance review spiral. Seriously, it's a cue to seek advice before burnout."
},
{
"verse": 31,
"sanskrit": "निमित्तानि च पश्यामि विपरीतानि केशव |\nन च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे ||",
"transliteration": "nimittāni ca paśyāmi viparītāni keśava\nna ca śreyo 'nupaśyāmi hatvā sva-janam āhave",
"translation": "I do not see how any good can come from killing my own kinsmen in this battle, nor can I, my dear Krishna, desire any subsequent victory, kingdom, or happiness.",
"modern": "Questioning the win's worth—like a promotion that costs friendships. It's profound: success without ethics is hollow."
},
{
"verse": 32,
"sanskrit": "न काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च |\nकिं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा ||",
"transliteration": "na kāṅkṣe vijayaṁ kṛṣṇa na ca rājyaṁ sukhāni ca\nkiṁ no rājyena govinda kiṁ bhogair jīvitena vā",
"translation": "O Govinda, of what avail to us are a kingdom, happiness or even life itself when all those for whom we may desire them are now arrayed on this battlefield?",
"modern": "Rejecting gains if they cost dear ones—like turning down overtime that steals family time. Funny how ambition blinds, but wisdom clarifies priorities."
},
{
"verse": 33,
"sanskrit": "येषामर्थे काङ्क्षितं नो राज्यं भोगाः सुखानि च |\nत इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च ||",
"transliteration": "yeṣām arthe kāṅkṣitaṁ no rājyaṁ bhogāḥ sukhāni ca\nta ime 'vasthitā yuddhe prāṇāṁs tyaktvā dhanāni ca",
"translation": "O Madhusudana, when teachers, fathers, sons, grandfathers, maternal uncles, fathers-in-law, grandsons, brothers-in-law and other relatives are ready to give up their lives and properties and are standing before me, why should I wish to kill them, even though they might otherwise kill me?",
"modern": "Why fight those we love?—like office rivals who are also friends. It challenges the cost of competition in close-knit teams."
},
{
"verse": 34,
"sanskrit": "आचार्याः पितरः पुत्रास्तथैव च पितामहाः |\nमातुलाः श्वशुराः पौत्राः श्यालाः सम्बन्धिनस्तथा ||",
"transliteration": "ācāryāḥ pitaraḥ putrās tathaiva ca pitāmahāḥ\nmātulāḥ śvaśurāḥ pautrāḥ śyālāḥ sambandhinas tathā",
"translation": "Teachers, fathers, sons, grandfathers, maternal uncles, fathers-in-law, grandsons, brothers-in-law and all relatives,",
"modern": "Listing bonds—like a family org chart. It reminds us conflicts ripple through networks, affecting work-life balance."
},
{
"verse": 35,
"sanskrit": "एतान्न हन्तुमिच्छामि घ्नतोऽपि मधुसूदन |\nअपि त्रैलोक्यराज्यस्य हेतोः किं नु महीकृते ||",
"transliteration": "etān na hantum icchāmi ghnato 'pi madhusūdana\napi trailokya-rājyasya hetoḥ kiṁ nu mahī-kṛte",
"translation": "O maintainer of all living entities, I am not prepared to fight with them even in exchange for the three worlds, let alone this earth. What pleasure will we derive from killing the sons of Dhritarashtra?",
"modern": "Not worth the universe—like declining a lucrative deal with shady ethics. It's a stand for principles over profits."
},
{
"verse": 36,
"sanskrit": "निहत्य धार्तराष्ट्रान्नः का प्रीतिः स्याज्जनार्दन |\nपापमेवाश्रयेदस्मान्हत्वैतानाततायिनः ||",
"transliteration": "nihatya dhārtarāṣṭrān naḥ kā prītiḥ syāj janārdana\npāpam evāśrayed asmān hatvaitān ātatāyinaḥ",
"translation": "Sin will overcome us if we slay such aggressors. Therefore it is not proper for us to kill the sons of Dhritarashtra and our friends. What should we gain, O Krishna, husband of the goddess of fortune, and how could we be happy by killing our own kinsmen?",
"modern": "Victory tainted by sin—like a win from cutting corners. Questions if short-term gains justify long-term regret."
},
{
"verse": 37,
"sanskrit": "यद्यप्येते न पश्यन्ति लोभोपहतचेतसः |\nकुलक्षयकृतं दोषं मित्रद्रोहे च पातकम् ||",
"transliteration": "yady apy ete na paśyanti lobhopahata-cetasaḥ\nkula-kṣaya-kṛtaṁ doṣaṁ mitra-drohe ca pātakam",
"translation": "O Janardana, although these men, their hearts overtaken by greed, see no fault in killing one's family or quarreling with friends,",
"modern": "Greed blinds them—like execs ignoring ethics for bonuses. Critiques short-sighted ambition in corporate culture."
},
{
"verse": 38,
"sanskrit": "कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम् |\nकुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन ||",
"transliteration": "kathaṁ na jñeyam asmābhiḥ pāpād asmān nivartitum\nkula-kṣaya-kṛtaṁ doṣaṁ prapaśyadbhir janārdana",
"translation": "Why should we, who can see the crime in destroying a family, engage in these acts of sin, O Krishna?",
"modern": "Why join the folly?—like refusing to partake in toxic workplace behavior. Advocates ethical leadership."
},
{
"verse": 39,
"sanskrit": "कुलक्षये प्रणश्यन्ति कुलधर्माः सनातनाः |\nधर्मे नष्टे कुलं कृत्स्नमधर्मोऽभिभवत्युत ||",
"transliteration": "kula-kṣaye praṇaśyanti kula-dharmāḥ sanātanāḥ\ndharme naṣṭe kulaṁ kṛtsnam adharmo 'bhibhavaty uta",
"translation": "With the destruction of the dynasty, the eternal family tradition is vanquished, and thus the rest of the family becomes involved in irreligion.",
"modern": "Family destruction erodes values—like a company scandal tarnishing culture. Warns of cascading effects in organizations."
},
{
"verse": 40,
"sanskrit": "अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रियः |\nस्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसङ्करः ||",
"transliteration": "adharmābhibhavāt kṛṣṇa praduṣyanti kula-striyaḥ\nstrīṣu duṣṭāsu vārṣṇeya jāyate varṇa-saṅkaraḥ",
"translation": "When irreligion is prominent in the family, O Krishna, the women of the family become polluted, and from the degradation of womanhood, O descendant of Vrishni, comes unwanted progeny.",
"modern": "Chaos affects future generations—like poor leadership creating a toxic legacy. Highlights protecting core values."
},
{
"verse": 41,
"sanskrit": "सङ्करो नरकायैव कुलघ्नानां कुलस्य च |\nपतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रियाः ||",
"transliteration": "saṅkaro narakāyaiva kula-ghnānāṁ kulasya ca\npatanti pitaro hy eṣāṁ lupta-piṇḍodaka-kriyāḥ",
"translation": "An increase of unwanted children certainly causes hellish life for both the family and those who destroy the family. The ancestors of such corrupt families fall down, because the performances for offering them food and water are entirely stopped.",
"modern": "Generational fallout—like bad decisions haunting successors. Think succession planning gone wrong in family businesses."
},
{
"verse": 42,
"sanskrit": "दोषैरेतैः कुलघ्नानां वर्णसङ्करकारकैः |\nउत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः ||",
"transliteration": "doṣair etaiḥ kula-ghnānāṁ varṇa-saṅkara-kārakaiḥ\nutsādyante jāti-dharmāḥ kula-dharmāś ca śāśvatāḥ",
"translation": "By the evil deeds of those who destroy the family tradition and thus give rise to unwanted children, all kinds of community projects and family welfare activities are devastated.",
"modern": "Societal norms crumble—like a viral scandal eroding trust. Calls for preserving integrity in communities and companies."
},
{
"verse": 43,
"sanskrit": "उत्सन्नकुलधर्माणां मनुष्याणां जनार्दन |\nनरके नियतं वासो भवतीत्यनुशुश्रुम ||",
"transliteration": "utsanna-kula-dharmāṇāṁ manuṣyāṇāṁ janārdana\nnarake niyataṁ vāso bhavatīty anuśuśruma",
"translation": "O Krishna, maintainer of the people, I have heard by disciplic succession that those whose family traditions are destroyed dwell always in hell.",
"modern": "Tradition warns of downfall—like elder advice in mentorship programs. Blends wisdom with the humor of ignoring 'old-school' tips at your peril."
},
{
"verse": 44,
"sanskrit": "अहो बत महत्पापं कर्तुं व्यवसिता वयम् |\nयद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः ||",
"transliteration": "aho bata mahat pāpaṁ kartuṁ vyavasitā vayam\nyad rājya-sukha-lobhena hantuṁ sva-janam udyatāḥ",
"translation": "Alas, how strange it is that we are preparing to commit greatly sinful acts. Driven by the desire to enjoy royal happiness, we are intent on killing our own kinsmen.",
"modern": "Lamenting greed-driven sin—like chasing KPIs at the expense of team morale. It's a wake-up call to check motivations."
},
{
"verse": 45,
"sanskrit": "यदि मामप्रतीकारमशस्त्रं शस्त्रपाणयः |\nधार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत् ||",
"transliteration": "yadi mām apratīkāram aśastraṁ śastra-pāṇayaḥ\ndhārtarāṣṭrā raṇe hanyus tan me kṣemataram bhavet",
"translation": "Better for me if the sons of Dhritarashtra, weapons in hand, were to kill me unarmed and unresisting on the battlefield.",
"modern": "Preferring passive defeat—like walking away from a toxic argument. Inspires non-violent resolution in conflicts."
},
{
"verse": 46,
"sanskrit": "सञ्जय उवाच |\nएवमुक्त्वार्जुनः सङ्ख्ये रथोपस्थ उपाविशत् |\nविसृज्य सशरं चापं शोकसंविग्नमानसः ||",
"transliteration": "sañjaya uvāca\nevam uktvārjunaḥ saṅkhye rathopastha upāviśat\nvisṛjya sa-śaraṁ cāpaṁ śoka-saṁvigna-mānasaḥ",
"translation": "Sanjaya said: Arjuna, having thus spoken on the battlefield, cast aside his bow and arrows and sat down on the chariot, his mind overwhelmed with grief.",
"modern": "Arjuna collapses in grief—like hitting burnout wall. Sets up for guidance, reminding us vulnerability precedes growth."
},
{
"verse": 47,
"sanskrit": "ॐ तत्सदिति श्रीमद्भगवद्गीतासूपनिषत्सु ब्रह्मविद्यायां योगशास्त्रे श्रीकृष्णार्जुनसंवादे अर्जुनविषादयोगो नाम प्रथमोऽध्यायः ||",
"transliteration": "oṁ tat sad iti śrīmad bhagavad-gītāsu upaniṣatsu brahma-vidyāyāṁ yoga-śāstre śrī-kṛṣṇārjuna-saṁvāde arjuna-viṣāda-yogo nāma prathamo 'dhyāyaḥ",
"translation": "Thus ends Chapter 1 of the Bhagavad Gita, entitled 'Arjuna Vishada Yoga.'",
"modern": "Chapter close—like wrapping a therapy session. Arjuna's despair mirrors modern crises, paving the way for profound insights on duty and detachment."
}
]
}
