{
  "number": 7,
  "title": "Knowledge and Wisdom",
  "sanskrit": "ज्ञानविज्ञानयोग",
  "verses": 30,
  "introduction": "Chapter 7 of the Bhagavad Gita, Jnana Vijnana Yoga (The Yoga of Knowledge and Realization), is one of the most profound and reassuring chapters in the entire text. Krishna now moves from practical instructions on action, meditation, and discipline into direct revelation of who He really is — and what the ultimate reality looks like. This is the chapter where Krishna says, in essence: 'Let me tell you the truth about Myself, about this universe, about why people suffer, and about how the rare few come to truly know Me.' For modern readers — especially those who feel spiritually curious yet overwhelmed by theories, paths, and self-improvement noise — Chapter 7 is pure clarity. Krishna distinguishes between lower knowledge (material world, science, psychology) and higher knowledge (direct realization of the Divine). He explains why most people miss the truth, why some rare souls find it, and how devotion (bhakti) becomes the simplest and most direct bridge to the Supreme. In 2026 life — full of information overload, existential anxiety, endless scrolling, and spiritual shopping — this chapter is the reset button: stop chasing concepts, start knowing the Person/Source behind everything. The essence remains untouched: true wisdom is not accumulating more ideas, but recognizing the Divine as the only real substance of existence, and approaching that Divine with love and surrender.",
  "shlokas": [
    {
      "verse": 1,
      "sanskrit": "श्रीभगवानुवाच |\nमय्यासक्तमनः पार्थ योगं युञ्जन्मदाश्रयः |\nअसंशयं समग्रं मां यथा ज्ञास्यसि तच्छृणु ||",
      "transliteration": "śrī-bhagavān uvāca\nmayy āsakta-manāḥ pārtha yogaṁ yuñjan mad-āśrayaḥ\nasaṁśayaṁ samagraṁ māṁ yathā jñāsyasi tac chṛṇu",
      "translation": "The Supreme Personality of Godhead said: Now hear, O son of Pritha [Arjuna], how by practicing yoga in full consciousness of Me, with mind attached to Me, you can know Me in full, free from doubt.",
      "modern": "Krishna begins with an invitation that cuts through all confusion: 'Fix your mind on Me, take refuge in Me, practice yoga with Me as the focus — and you will know Me completely, without doubt.' This is the antidote to spiritual shopping and theory overload. In 2026 life, most people collect concepts, techniques, gurus, apps, retreats — but Krishna says: stop scattering. Choose one point of focus — Me (the Supreme Reality, however you conceive it) — and direct everything toward that. Full knowledge comes not from more information, but from wholehearted relationship and surrender. This verse is the turning point: the Gita now becomes deeply personal and devotional. Krishna is saying: 'You want certainty? Attach to Me. That’s the shortcut.' For anyone tired of endless seeking, this is liberating."
    },
    {
      "verse": 2,
      "sanskrit": "ज्ञानं तेऽहं सविज्ञानमिदं वक्ष्याम्यशेषतः |\nयज्ज्ञात्वा नेह भूयोऽन्यज्ज्ञातव्यमवशिष्यति ||",
      "transliteration": "jñānaṁ te ’haṁ sa-vijñānam idaṁ vakṣyāmy aśeṣataḥ\nyaj jñātvā neha bhūyo ’nyaj jñātavyam avaśiṣyati",
      "translation": "I shall now declare unto you in full this knowledge both phenomenal and noumenal, by knowing which there shall remain nothing further to be known.",
      "modern": "Krishna promises complete knowledge — both the visible world (vijnana) and the ultimate reality (jnana) — after which nothing more needs to be known. This is the ultimate 'enough' moment. In today’s world of infinite content tabs, courses, podcasts, and rabbit holes, Krishna is offering closure: there is a final understanding that ends the search. Not more facts, but direct realization that satisfies the soul completely. For the exhausted seeker who feels 'I’ve read everything and still don’t know,' Krishna says: 'Listen — I’m about to give you the final piece. After this, rest.' This verse creates deep relief — the search can end when real knowledge arrives."
    },
    {
      "verse": 3,
      "sanskrit": "मनुष्याणां सहस्रेषु कश्चिद्यतति सिद्धये |\nयततामपि सिद्धानां कश्चिन्मां वेत्ति तत्त्वतः ||",
      "transliteration": "manuṣyāṇāṁ sahasreṣu kaścid yatati siddhaye\nyatatām api siddhānāṁ kaścin māṁ vetti tattvataḥ",
      "translation": "Out of many thousands among men, one may endeavor for perfection, and of those who have achieved perfection, hardly one knows Me in truth.",
      "modern": "Rare is the person who even tries for perfection, and rarer still is the one who truly knows the Divine in essence. This verse is both sobering and hopeful. In 2026: billions scroll, consume, hustle — very few seriously seek self-realization. And among serious seekers, very few reach direct knowledge of the Supreme as a living relationship. Krishna is realistic: the path is narrow, the goal is rare. But the fact that He is saying it means it is possible. This verse kills spiritual pride ('I’ve been meditating for 5 years so I must be advanced') and inspires humility and persistence. Even among the 'successful' meditators, true knowing is exceptional. Keep going — the rare ones do."
    },
    {
      "verse": 4,
      "sanskrit": "भूमिरापोऽनलो वायुः खं मनो बुद्धिरेव च |\nअहङ्कार इतीयं मे भिन्ना प्रकृतिरष्टधा ||",
      "transliteration": "bhūmir āpo ’nalo vāyuḥ khaṁ mano buddhir eva ca\nahaṅkāra itīyaṁ me bhinnā prakṛtir aṣṭadhā",
      "translation": "Earth, water, fire, air, ether, mind, intelligence and false ego — altogether these eight comprise My separated material energies.",
      "modern": "Krishna lists the eightfold material nature (prakriti): the five elements + mind + intellect + ego. This is the complete inventory of the 'lower' reality — everything we experience through senses and mind is made of these. In 2026 science terms: matter, energy, space-time, consciousness structures, ego-identity — all part of one cosmic energy field emanating from the Divine. Krishna is saying: the entire material universe you see, feel, think, and identify with is My 'lower nature.' It’s real, but derivative. This demystifies the world: nothing is ultimately separate or independent — it’s all a manifestation of one Source. Knowing this intellectually is the beginning of detachment."
    },
    {
      "verse": 5,
      "sanskrit": "अपरेयमितस्त्वन्यां प्रकृतिं विद्धि मे पराम् |\nजीवभूतां महाबाहो ययेदं धार्यते जगत् ||",
      "transliteration": "apareyam itas tv anyāṁ prakṛtiṁ viddhi me parām\njīva-bhūtāṁ mahā-bāho yayedaṁ dhāryate jagat",
      "translation": "Besides this inferior nature, O mighty-armed Arjuna, there is a superior energy of Mine, which are all living entities who are struggling with material nature and are sustaining the universe.",
      "modern": "Beyond the material eightfold nature is My higher nature — the living souls (jiva-bhuta) that animate and uphold the world. This is the distinction between matter and consciousness. In modern terms: the physical universe (elements, mind, ego) is the hardware; the souls are the sentient beings running on that hardware. Krishna is saying: I have two energies — the inert/material and the conscious/living. You are part of the higher one. This is the key shift: you are not your body, mind, or ego — you are the conscious spark. That realization begins true freedom. The world is sustained by souls interacting with matter — but souls are superior. Know this and you stop worshipping the hardware."
    },
    {
      "verse": 6,
      "sanskrit": "एतद्योनीनि भूतानि सर्वाणीत्युपधारय |\nअहं कृत्स्नस्य जगतः प्रभवः प्रलयस्तथा ||",
      "transliteration": "etad-yonīni bhūtāni sarvāṇīty upadhāraya\nahaṁ kṛtsnasya jagataḥ prabhavaḥ pralayas tathā",
      "translation": "Of all that is material and all that is spiritual in this world, know for certain that I am both its origin and dissolution.",
      "modern": "Everything — matter and spirit — is born from Me and dissolves back into Me. Krishna declares: I am the source and end of the entire cosmos. In 2026 terms: the Big Bang, the laws of physics, consciousness, galaxies, thoughts, emotions — all emerge from and return to one ultimate reality. This is non-dual Advaita in devotional language. Krishna is not one being among many — He is the substratum of existence itself. Knowing this ends existential fear. You are not a tiny separate thing in a vast, indifferent universe — you are part of the Divine that is the universe. This is the ultimate reframe for loneliness and insignificance."
    },
    {
      "verse": 7,
      "sanskrit": "मत्तः परतरं नान्यत्किञ्चिदस्ति धनञ्जय |\nमयि सर्वमिदं प्रोतं सूत्रे मणिगणा इव ||",
      "transliteration": "mattaḥ parataraṁ nānyat kiñcid asti dhanañjaya\nmayi sarvam idaṁ protaṁ sūtre maṇi-gaṇā iva",
      "translation": "O conqueror of wealth [Arjuna], there is no Truth superior to Me. Everything rests upon Me, as pearls are strung on a thread.",
      "modern": "Nothing is higher than Me. Everything is threaded on Me like pearls on a string. This is one of the most famous and powerful verses in the Gita. In 2026 life: every experience, every object, every person, every thought — all are appearances on the single thread of Divine reality. The thread is invisible but essential. Without it, no pearls. Krishna is saying: stop looking for something 'beyond' or 'higher' — I am the substratum of everything. Realize this and the search ends. This verse is the non-dual revelation in personal language. Everything you see is Me wearing different costumes. Rest in that recognition and fear disappears."
    },
    {
      "verse": 8,
      "sanskrit": "रसोऽहमप्सु कौन्तेय प्रभास्मि शशिसूर्ययोः |\nप्रणवः सर्ववेदेषु शब्दः खे पौरुषं नृषु ||",
      "transliteration": "raso ’ham apsu kaunteya prabhāsmi śaśi-sūryayoḥ\npraṇavaḥ sarva-vedeṣu śabdaḥ khe pauruṣaṁ nṛṣu",
      "translation": "O son of Kunti [Arjuna], I am the taste of water, the light of the sun and the moon, the syllable om in the Vedic mantras; I am the sound in ether and ability in man.",
      "modern": "Krishna reveals Himself as the essence of everything: the taste in water (life-force), the light in sun/moon (illumination), the sacred syllable Om (primordial vibration), sound in space, strength in humans. This is intimate, non-abstract divinity. In daily life: when you drink water and feel refreshed — that’s Me. When sunlight hits your face — that’s Me. When you hear a beautiful sound or feel inner strength — that’s Me. Krishna is everywhere, in the most ordinary experiences. This turns routine moments into divine encounters. No need to wait for special experiences — divinity is already in the taste, the light, the sound, the breath, the courage. This is the practice: recognize Me in the everyday."
    },
    {
      "verse": 9,
      "sanskrit": "पुण्यो गन्धः पृथिव्यां च तेजश्चास्मि विभावसौ |\nजीवनं सर्वभूतेषु तपश्चास्मि तपस्विषु ||",
      "transliteration": "puṇyo gandhaḥ pṛthivyāṁ ca tejaś cāsmi vibhāvasau\njīvanaṁ sarva-bhūteṣu tapaś cāsmi tapasviṣu",
      "translation": "I am the original fragrance of the earth, and I am the heat in fire. I am the life of all that lives, and I am the penances of all ascetics.",
      "modern": "Krishna continues: I am the pure fragrance of earth, the heat/energy in fire, the life-force in all beings, the discipline in ascetics. In 2026: when you smell rain on soil — that’s Me. When you feel warmth from the sun or a good workout — that’s Me. When you feel alive and present — that’s Me. When someone shows discipline or tapas (inner heat of transformation) — that’s Me. This makes every sensory experience sacred. Krishna is saturating the world with His presence. The practice becomes: savor the fragrance, feel the warmth, notice the aliveness, respect the discipline — see Me everywhere. Ordinary moments become worship."
    },
    {
      "verse": 10,
      "sanskrit": "बीजं मां सर्वभूतानां विद्धि पार्थ सनातनम् |\nबुद्धिर्बुद्धिमतामस्मि तेजस्तेजस्विनामहम् ||",
      "transliteration": "bījaṁ māṁ sarva-bhūtānāṁ viddhi pārtha sanātanam\nbuddhir buddhimatām asmi tejas tejasvinām aham",
      "translation": "O son of Pritha, know that I am the original seed of all existences, the intelligence of the intelligent, and the prowess of all powerful men.",
      "modern": "I am the eternal seed of all beings, the intelligence in the wise, the brilliance in the brilliant. In modern terms: every new idea, every startup seed, every moment of clarity, every act of courage or excellence — I am the source. Krishna is claiming the root of all creativity, wisdom, and power. This ends the illusion of independent achievement. When you have a breakthrough idea, feel sharp intellect, or witness someone’s greatness — recognize the Divine spark. This makes humility natural and gratitude constant. Your intelligence, your brilliance — they are gifts from the Source. Acknowledge that and ego dissolves."
    },
    {
      "verse": 11,
      "sanskrit": "बलं बलवतां चाहं कामरागविवर्जितम् |\nधर्माविरुद्धो भूतेषु कामोऽस्मि भरतर्षभ ||",
      "transliteration": "balaṁ balavatāṁ cāhaṁ kāma-rāga-vivarjitam\ndharmāviruddho bhūteṣu kāmo ’smi bharatarṣabha",
      "translation": "I am the strength of the strong, devoid of passion and desire. I am sex life which is not contrary to religious principles, O lord of the Bharatas [Arjuna].",
      "modern": "I am the strength of the strong — but free from lust and attachment. I am desire/sexuality that aligns with dharma (righteousness). This is revolutionary balance. Krishna does not condemn strength or sexuality — He claims them when they are pure and dharmic. In 2026: healthy ambition, disciplined power, consensual loving intimacy — these are divine when free from greed or exploitation. Krishna is reclaiming what religion often demonizes: power and desire are not evil — they are divine when directed rightly. This verse heals a lot of guilt around ambition and sexuality. Embrace them with purity and they become part of the path."
    },
    {
      "verse": 12,
      "sanskrit": "ये चैव सात्त्विका भावा राजसास्तामसाश्च ये |\nमत्त एवेति तान्विद्धि न त्वहं तेषु ते मयि ||",
      "transliteration": "ye caiva sāttvikā bhāvā rājasās tāmasāś ca ye\nmatta eveti tān viddhi na tv ahaṁ teṣu te mayi",
      "translation": "All states of being — be they in goodness, passion or ignorance — are manifested by My energy. I am, in one sense, everything — but I am not under their control. They are in Me, but I am not in them.",
      "modern": "All three gunas (sattva, rajas, tamas) — clarity, passion, inertia — come from Me. I am in everything, but nothing controls Me. This is the key non-dual statement. In practice: every mood, every motivation, every state you experience is a wave on the ocean of the Divine. The ocean (Krishna) is not affected by the waves. This gives radical freedom: you can feel anger, laziness, clarity — and know none of them define or limit the real You. Krishna is everywhere, yet transcendent. This ends identification with temporary states. You are the screen, not the movie playing on it."
    },
    {
      "verse": 13,
      "sanskrit": "त्रिभिर्गुणमयैर्भावैरेभिः सर्वमिदं जगत् |\nमोहितं नाभिजानाति मामेभ्यः परमव्ययम् ||",
      "transliteration": "tribhir guṇa-mayair bhāvair ebhiḥ sarvam idaṁ jagat\nmohitaṁ nābhijānāti mām ebhyaḥ param avyayam",
      "translation": "Deluded by the three modes [goodness, passion and ignorance], the whole world does not know Me who am beyond them and inexhaustible.",
      "modern": "The entire world is deluded by the three gunas and cannot recognize Me as the unchanging reality beyond them. This explains spiritual blindness. In 2026: people chase clarity (sattva), excitement (rajas), or numbness (tamas) — but rarely see the One behind all three. Krishna is saying: the reason most people don’t 'get' the Divine is because they’re stuck inside the guna play. To know Him, step outside the three modes. This is why meditation, detachment, and devotion are emphasized — they lift you beyond guna identification. The world is hypnotized by its own drama. Wake up and see the Witness."
    },
    {
      "verse": 14,
      "sanskrit": "दैवी ह्येषा गुणमयी मम माया दुरत्यया |\nमामेव ये प्रपद्यन्ति मायामेतां तरन्ति ते ||",
      "transliteration": "daivī hy eṣā guṇa-mayī mama māyā duratyayā\nmām eva ye prapadyanti māyām etāṁ taranti te",
      "translation": "This divine energy of Mine, consisting of the three modes of material nature, is difficult to overcome. But those who have surrendered unto Me can easily cross beyond it.",
      "modern": "My maya (illusion power) made of the three gunas is very hard to cross — but those who take refuge in Me cross it easily. This is the famous maya verse. In 2026: the matrix of conditioning, desires, fears, societal programming — it’s incredibly hard to break free. Willpower alone fails. But surrender to the Divine (however you conceive it) makes it easy. This is the grace factor. Krishna is saying: don’t try to outsmart maya with ego — surrender to Me and I’ll carry you across. This is why bhakti (devotion) is called the easiest path in Kali Yuga. Grace trumps effort when effort is offered."
    },
    {
      "verse": 15,
      "sanskrit": "न मां दुष्कृतिनो मूढाः प्रपद्यन्ते नराधमाः |\nमाययापहृतज्ञाना आसुरं भावमाश्रिताः ||",
      "transliteration": "na māṁ duṣkṛtino mūḍhāḥ prapadyante narādhamāḥ\nmāyayāpahṛta-jñānā āsuraṁ bhāvam āśritāḥ",
      "translation": "Those miscreants who are grossly foolish, lowest among mankind, whose knowledge is stolen by illusion, and who partake of the atheistic nature of demons, do not surrender unto Me.",
      "modern": "The four types who don’t surrender: evil-doers, fools, lowest of men, those whose knowledge is stolen by maya, and those with demonic mentality. Krishna is describing the psychology of refusal. In 2026: people who actively harm others, those too arrogant or distracted to seek truth, those whose wisdom is clouded by materialism, and those who deliberately choose against the higher (demonic = anti-divine). This verse explains spiritual resistance — it’s not always innocent ignorance. Sometimes it’s pride, selfishness, or deliberate rebellion. Krishna is compassionate but clear: these attitudes block surrender. The solution: humility, sincerity, openness. Without them, even the clearest teaching is missed."
    },
    {
      "verse": 16,
      "sanskrit": "चतुर्विधा भजन्ते मां जनाः सुकृतिनोऽर्जुन |\nआर्तो जिज्ञासुरर्थार्थी ज्ञानी च भरतर्षभ ||",
      "transliteration": "catur-vidhā bhajante māṁ janāḥ sukṛtino ’rjuna\nārto jijñāsur arthārthī jñānī ca bharatarṣabha",
      "translation": "O best among the Bharatas [Arjuna], four kinds of pious men render devotional service unto Me — the distressed, the seeker of wealth, the inquisitive, and he who is in search of knowledge of the Absolute.",
      "modern": "Four types approach the Divine with devotion: 1) those in distress (arto), 2) those seeking wealth/material gain (artharthi), 3) those who are curious/inquisitive (jijnasu), 4) those seeking true knowledge of the Absolute (jnani). This is compassionate realism. Krishna accepts all four — no judgment. In 2026: people pray when in crisis, when they want success, when they’re spiritually curious, or when they genuinely seek truth. All are valid entry points. Krishna doesn’t say 'only the pure come to Me.' He welcomes the messy beginnings. This verse removes spiritual elitism. Wherever you start — pain, desire, curiosity, or wisdom — it’s okay. Just start. The Divine meets you there."
    },
    {
      "verse": 17,
      "sanskrit": "तेषां ज्ञानी नित्ययुक्त एकभक्तिर्विशिष्यते |\nप्रियो हि ज्ञानिनोऽत्यर्थमहं स च मम प्रियः ||",
      "transliteration": "teṣāṁ jñānī nitya-yukta eka-bhaktir viśiṣyate\npriyo hi jñānino ’tyartham ahaṁ sa ca mama priyaḥ",
      "translation": "Of these, the wise one who is in full knowledge of Me and is constantly engaged in My service is the best. For I am very dear to him, and he is dear to Me.",
      "modern": "Among the four, the jnani (knower) who is constantly united with Me in single-pointed devotion is the highest. We are extremely dear to each other. This is the heart of bhakti. Krishna loves the one who knows Him as the Supreme and loves Him exclusively. In practice: the person who has moved beyond crisis-prayers or desire-prayers into loving relationship — that’s the highest. Mutual dearness. This is not dry knowledge — it’s intimate devotion. Krishna is revealing the emotional core: the Divine wants to be loved personally. This verse is the sweetest — God says 'you are very dear to Me.' That alone can heal lifetimes of feeling unworthy or unseen."
    },
    {
      "verse": 18,
      "sanskrit": "उदाराः सर्व एवैते ज्ञानी त्वात्यर्थमेव मे |\nइष्टो हि ज्ञानिनोऽत्यर्थमहं स च मम प्रियः ||",
      "transliteration": "udārāḥ sarva evaite jñānī tv atyartham eva me\niṣṭo hi jñānino ’tyartham ahaṁ sa ca mama priyaḥ",
      "translation": "All these devotees are undoubtedly magnanimous, but he who is situated in knowledge of Me I consider to be just like My very self. For he is engaged in My loving service, and I am the supreme goal for him.",
      "modern": "All four are noble, but the knower/devotee is especially dear — I consider him like My own self. He is devoted to Me as the supreme goal, and I am devoted to him. This is the mutual indwelling. In practice: the one who knows 'Krishna (the Divine) is my everything' becomes one with the Divine in love. This is the non-dual relationship — not merger into nothingness, but eternal loving union. Krishna is saying the devotee-knower is not just close — he is like My own Self. This is the highest intimacy possible. The Divine claims the lover as His own. This verse melts the heart and ends separation anxiety forever."
    },
    {
      "verse": 19,
      "sanskrit": "बहूनां जन्मनामन्ते ज्ञानवान्मां प्रपद्यते |\nवासुदेवः सर्वमिति स महात्मा सुदुर्लभः ||",
      "transliteration": "bahūnāṁ janmanām ante jñānavān māṁ prapadyate\nvāsudevaḥ sarvam iti sa mahātmā su-durlabhaḥ",
      "translation": "After many births and deaths, he who is actually in knowledge surrenders unto Me, knowing Me to be the cause of all causes and all that is. Such a great soul is very rare.",
      "modern": "After many lifetimes, the wise one finally surrenders, realizing 'Vasudeva (Krishna/the Divine) is everything.' Such a mahatma is extremely rare. This verse explains why genuine surrender is uncommon. Most people take lifetimes of experience to reach the point of 'enough — I see it’s all You.' In 2026: the person who finally stops chasing externals and says 'it’s all God' with full heart — that’s rare and precious. Krishna calls them mahatma (great soul). This gives hope: your search is not in vain — it’s maturing across lives. And when the realization comes, it’s complete. This is the moment the prodigal son returns home."
    },
    {
      "verse": 20,
      "sanskrit": "कामैस्तैस्तैर्हृतज्ञानाः प्रपद्यन्तेऽन्यदेवताः |\nतं तं नियममास्थाय प्रकृत्या नियताः स्वया ||",
      "transliteration": "kāmais tais tair hṛta-jñānāḥ prapadyante ’nya-devatāḥ\ntaṁ taṁ niyamam āsthāya prakṛtyā niyatāḥ svayā",
      "translation": "Those whose minds are distorted by material desires surrender unto demigods and follow the particular rules and regulations of worship according to their own natures.",
      "modern": "People whose wisdom is stolen by desires turn to lesser gods/forces and follow rituals according to their conditioning. In 2026: chasing money, fame, relationships, power, health hacks, manifestation techniques — all 'demigods.' People create their own rules and rituals around these. Krishna is compassionate but clear: these are secondary. Desire clouds judgment and leads to fragmented worship. The solution: purify desire and turn to the Supreme. This verse explains why most spirituality is partial — it’s desire-driven rather than truth-driven."
    },
    {
      "verse": 21,
      "sanskrit": "यो यो यां यां तनुं भक्तः श्रद्धयार्चितुमिच्छति |\nतस्य तस्याचलां श्रद्धां तामेव विदधाम्यहम् ||",
      "transliteration": "yo yo yāṁ yāṁ tanuṁ bhaktaḥ śraddhayārcitum icchati\ntasya tasyācalāṁ śraddhāṁ tām eva vidadhāmy aham",
      "translation": "I am in everyone’s heart as the Supersoul. As soon as one desires to worship some demigod, I make his faith steady so that he can devote himself to that particular deity.",
      "modern": "Krishna is in every heart as the Supersoul. When someone wants to worship a particular form or force, He strengthens their faith in that very form. This is extraordinary compassion and non-judgment. In 2026: whether someone prays to Jesus, Kali, money, success, or their own higher self — Krishna says 'I make their faith firm in whatever they choose.' This ends religious superiority. The Divine meets everyone where they are. This verse shows universal love: no one is rejected. Whatever form you approach with sincerity, the Divine responds. This is why faith works — it’s divinely supported."
    },
    {
      "verse": 22,
      "sanskrit": "स तया श्रद्धया युक्तस्तस्याराधनमीहते |\nलभते च ततः कामान्मयैव विहितान्हि तान् ||",
      "transliteration": "sa tayā śraddhayā yuktas tasyārādhanam īhate\nlabhate ca tataḥ kāmān mayaiva vihitān hi tān",
      "translation": "Endowed with that steady faith, he engages in the worship of that demigod and obtains his desires. But in actuality those benefits are bestowed by Me alone.",
      "modern": "With firm faith, people worship their chosen form and get results — but Krishna says: all results come from Me. In 2026: whether someone manifests through law of attraction, prays to a saint, or works hard for success — the underlying power is the Divine. This removes competition between paths. Krishna is saying: I answer through whatever form you approach. No path is 'wrong' if sincere. But ultimate credit goes to the Source. This verse promotes unity and humility — don’t fight over whose God is better. All genuine prayers reach the same One."
    },
    {
      "verse": 23,
      "sanskrit": "अन्तवत्तु फलं तेषां तद्भवत्यल्पमेधसाम् |\nदेवान्देवयजो यान्ति मद्भक्ता यान्ति मामपि ||",
      "transliteration": "antavat tu phalaṁ teṣāṁ tad bhavaty alpa-medhasām\ndevān deva-yajo yānti mad-bhaktā yānti mām api",
      "translation": "Men of small intelligence worship the demigods, and their fruits are limited and temporary. Those who worship the demigods go to the demigods, but My devotees ultimately come to Me.",
      "modern": "Worship of secondary forces gives temporary, limited results. Worship of the Supreme gives the Supreme. In practice: chasing money, fame, power, or even specific deities for specific boons — gets you those things temporarily. Devotion to the Source takes you to the Source — permanent. Krishna is not condemning other worship — He’s stating the hierarchy of outcomes. This verse explains why some people get what they pray for but still feel empty. The wise aim for the Infinite, not the finite. This is the call to go for the highest."
    },
    {
      "verse": 24,
      "sanskrit": "अव्यक्तं व्यक्तिमापन्नं मन्यन्ते मामबुद्धयः |\nपरं भावमजानन्तो ममाव्ययमनुत्तमम् ||",
      "transliteration": "avyaktaṁ vyaktim āpannaṁ manyante mām abuddhayaḥ\nparaṁ bhāvam ajānanto mamāvyayam anuttamam",
      "translation": "Unintelligent men, who do not know Me perfectly, think that I, the Supreme Personality of Godhead, Krishna, was impersonal before and have now assumed this personality. Due to their small knowledge, they do not know My higher nature, which is imperishable and supreme.",
      "modern": "People with limited understanding think the Divine was formless and then took form. They don’t know My supreme, imperishable nature. This verse corrects the misconception that God is ultimately impersonal or that personal devotion is lower. Krishna is saying: I am eternally personal — the impersonal is only an aspect. In 2026 spiritual culture: many prefer 'formless consciousness' because it feels advanced. Krishna lovingly corrects: the highest is personal relationship with the Supreme Person. This is bhakti’s bold claim — God has a face, a heart, and wants to be loved personally. This verse validates devotional practice as supreme."
    },
    {
      "verse": 25,
      "sanskrit": "नाहं प्रकाशः सर्वस्य योगमायासमावृतः |\nमूढोऽयं नाभिजानाति लोको मामजमव्ययम् ||",
      "transliteration": "nāhaṁ prakāśaḥ sarvasya yoga-māyā-samāvṛtaḥ\nmūḍho ’yaṁ nābhijānāti loko mām ajam avyayam",
      "translation": "I am never manifest to the foolish and unintelligent. For them I am covered by My eternal creative potency [yoga-maya]; and so the deluded world knows Me not, who am unborn and infallible.",
      "modern": "The Divine is hidden by yoga-maya (divine illusion) from those who are not ready. The world doesn’t recognize the unborn, unchanging reality. In practice: most people see only the material layer — they miss the Divine presence. This explains spiritual blindness. Krishna is not hiding maliciously — the veil protects the unprepared. When readiness comes (through suffering, grace, practice), the veil lifts. This verse brings humility: don’t judge those who don’t see. Their time will come. And for those who do see — it’s pure grace."
    },
    {
      "verse": 26,
      "sanskrit": "वेदाहं समतीतानि वर्तमानानि चार्जुन |\nभविष्याणि च भूतानि मां तु वेद न कश्चन ||",
      "transliteration": "vedāhaṁ samatītāni vartamānāni cārjuna\nbhaviṣyāṇi ca bhūtāni māṁ tu veda na kaścana",
      "translation": "O Arjuna, as the Supreme Personality of Godhead, I know everything that has happened in the past, all that is happening in the present, and all things that are to come. But no one knows Me.",
      "modern": "Krishna knows all past, present, future — but almost no one knows Him. This is the asymmetry of divine knowledge. In life: the Divine knows your every thought, every pain, every hope — intimately. Yet we rarely know Him. This verse evokes both awe and longing. Krishna is saying: I see you completely, even when you feel unseen. But to know Me — that requires turning toward Me. This creates deep intimacy: you are fully known. Now turn and know the Knower. That’s the invitation."
    },
    {
      "verse": 27,
      "sanskrit": "इच्छाद्वेषसमुत्थेन द्वन्द्वमोहेन भारत |\nसर्वभूतानि सम्मोहं सर्गे यान्ति परन्तप ||",
      "transliteration": "icchā-dveṣa-samutthena dvandva-mohena bhārata\nsarva-bhūtāni sammohaṁ sarge yānti parantapa",
      "translation": "O scion of Bharata [Arjuna], O conqueror of the foe, all living entities are born into delusion, bewildered by the dualities that arise from desire and hate.",
      "modern": "All beings are born into confusion, deluded by the pairs of opposites born from desire and aversion. This explains universal suffering. In 2026: every person is caught in like/dislike, attraction/repulsion — the root of anxiety, anger, addiction, depression. Krishna is diagnosing the human condition: duality-delusion caused by desire/aversion. The solution is coming — transcend duality through knowledge and devotion. This verse brings compassion: everyone is deluded, not evil. We’re all caught in the same trap. Understanding this ends judgment."
    },
    {
      "verse": 28,
      "sanskrit": "येषां त्वन्तगतं पापं जनानां पुण्यकर्मणाम् |\nते द्वन्द्वमोहनिर्मुक्ता भजन्ते मां दृढव्रताः ||",
      "transliteration": "yeṣāṁ tv anta-gataṁ pāpaṁ janānāṁ puṇya-karmaṇām\nte dvandva-moha-nirmuktā bhajante māṁ dṛḍha-vratāḥ",
      "translation": "But persons who have cleansed themselves of all sinful reactions by engaging in pious activities become free from duality and delusion and engage in My devotional service with determination.",
      "modern": "Those who have purified through good actions become free from duality-delusion and serve Me with firm resolve. This is the path out. In practice: ethical living, kindness, self-discipline — these purify. Purification leads to clarity. Clarity ends duality. Clarity allows steady devotion. This is the progressive journey. Krishna is saying: start where you are — do good, purify, and devotion becomes natural. No shortcuts. This verse gives hope: anyone can purify and reach the highest through consistent right action."
    },
    {
      "verse": 29,
      "sanskrit": "जरामरणमोक्षाय मामाश्रित्य यतन्ति ये |\nते ब्रह्म तद्विदुः कृत्स्नमध्यात्मं कर्म चाखिलम् ||",
      "transliteration": "jarā-maraṇa-mokṣāya mām āśritya yatanti ye\nte brahma tad viduḥ kṛtsnam adhyātmaṁ karma cākhilam",
      "translation": "Intelligent persons who are endeavoring for liberation from old age and death take refuge in Me in devotional service. They are actually able to understand Brahman, the individual self, and the activities of the material world.",
      "modern": "Those who seek freedom from birth/death take refuge in Me — they truly understand Brahman, the self, and all actions. This is the reward of surrender: complete knowledge. In practice: when you turn to the Divine with the desire for ultimate freedom, everything becomes clear — the Absolute, your true nature, and how the world works. This is the payoff of bhakti. Krishna is saying: don’t just seek knowledge for knowledge’s sake — seek liberation through relationship with Me. That brings all knowledge naturally. This verse connects devotion and wisdom — bhakti leads to jnana."
    },
    {
      "verse": 30,
      "sanskrit": "साधिभूताधिदैवं मां साधियज्ञं च ये विदुः |\nप्रयाणकालेऽपि च मां ते विदुर्युक्तचेतसः ||",
      "transliteration": "sādhibhūtādhidaivaṁ māṁ sādhiyajñaṁ ca ye viduḥ\nprayāṇa-kāle ’pi ca māṁ te vidur yukta-cetasaḥ",
      "translation": "Those who know Me as the governing principle of the material manifestation, of the demigods, and of all sacrifices, and who know Me also as the Supreme Soul present in everyone’s heart, are able to know Me at the time of death with steady mind.",
      "modern": "Those who know Me as the controller of matter, deities, and sacrifice — and as the Supersoul in all hearts — remember Me at death with steady mind. This is the promise of a conscious exit. In practice: understand the Divine as the source and sustainer of everything — and as your innermost companion. That realization stays with you at the moment of death. Krishna is saying: know Me fully — as cosmic, personal, and intimate — and death becomes a conscious transition, not a fearful blank. This verse gives the ultimate security: steady remembrance at the end. Practice that remembrance now."
    }
  ]
}
