{
  "number": 3,
  "title": "The Path of Action",
  "sanskrit": "कर्मयोग",
  "verses": 43,
  "introduction": "After hearing about the eternal soul and knowledge in Chapter 2, Arjuna is confused why Krishna is pushing him to fight if knowledge is superior. Krishna clarifies that selfless action (Karma Yoga) is the path for most people - not renunciation of action, but action without attachment to results.",
  "shlokas": [
    {"verse": 1, "sanskrit": "अर्जुन उवाच | ज्यायसी चेत्कर्मणस्ते मता बुद्धिर्जनार्दन | तत्किं कर्मणि घोरे मां नियोजयसि केशव ||", "transliteration": "arjuna uvāca | jyāyasī cet karmaṇas te matā buddhir janārdana | tat kiṁ karmaṇi ghore māṁ niyojayasi keśava", "translation": "Arjuna said: O Krishna, if You consider knowledge superior to action, why do You ask me to engage in this terrible action?", "modern": "Classic confusion: 'If thinking is better, why make me act?' We all feel this. Meditation vs hustle. Study vs work. But life requires both. You can't just sit and think forever."},
    {"verse": 2, "sanskrit": "व्यामिश्रेणेव वाक्येन बुद्धिं मोहयसीव मे | तदेकं वद निश्चित्य येन श्रेयोऽहमाप्नुयाम् ||", "transliteration": "vyāmiśreṇeva vākyena buddhiṁ mohayasīva me | tad ekaṁ vada niścitya yena śreyo 'ham āpnuyām", "translation": "With seemingly contradictory statements, You are confusing my understanding. Please tell me decisively the one path by which I may attain the highest good.", "modern": "Give me ONE clear answer! We hate ambiguity. We want simple rules. But wisdom is nuanced. There's no one-size-fits-all path."},
    {"verse": 3, "sanskrit": "श्रीभगवानुवाच | लोकेऽस्मिन्द्विविधा निष्ठा पुरा प्रोक्ता मयानघ | ज्ञानयोगेन साङ्ख्यानां कर्मयोगेन योगिनाम् ||", "transliteration": "śrī-bhagavān uvāca | loke 'smin dvi-vidhā niṣṭhā purā proktā mayānagha | jñāna-yogena sāṅkhyānāṁ karma-yogena yoginām", "translation": "The Lord said: In this world there are two paths - the path of knowledge for the contemplative, and the path of work for the active.", "modern": "Two types of people: thinkers and doers. Philosophers and practitioners. Both valid. Know which one you are. Don't force yourself to be what you're not."},
    {"verse": 4, "sanskrit": "न कर्मणामनारम्भान्नैष्कर्म्यं पुरुषोऽश्नुते | न च संन्यसनादेव सिद्धिं समधिगच्छति ||", "transliteration": "na karmaṇām anārambhān naiṣkarmyaṁ puruṣo 'śnute | na ca saṁnyasanād eva siddhiṁ samadhigacchati", "translation": "Not by merely abstaining from work can one achieve freedom from action, nor by renunciation alone can one attain perfection.", "modern": "You can't just quit everything and call it spiritual. Sitting on a mountain meditating while avoiding life isn't enlightenment - it's escapism. Real growth happens IN life, not away from it."},
    {"verse": 5, "sanskrit": "न हि कश्चित्क्षणमपि जातु तिष्ठत्यकर्मकृत् | कार्यते ह्यवशः कर्म सर्वः प्रकृतिजैर्गुणैः ||", "transliteration": "na hi kaścit kṣaṇam api jātu tiṣṭhaty akarma-kṛt | kāryate hy avaśaḥ karma sarvaḥ prakṛti-jair guṇaiḥ", "translation": "No one can remain without acting even for a moment. Everyone is forced to act by nature's qualities.", "modern": "You're always doing SOMETHING. Even meditation is an action. Scrolling is action. Thinking is action. There's no such thing as non-action. The question is: what KIND of action?"},
    {"verse": 6, "sanskrit": "कर्मेन्द्रियाणि संयम्य य आस्ते मनसा स्मरन् | इन्द्रियार्थान्विमूढात्मा मिथ्याचारः स उच्यते ||", "transliteration": "karmendriyāṇi saṁyamya ya āste manasā smaran | indriyārthān vimūḍhātmā mithyācāraḥ sa ucyate", "translation": "One who restrains the senses but dwells on sense objects in the mind is a pretender and hypocrite.", "modern": "Fake spiritual people. They act holy but their mind is still obsessed with what they're 'giving up.' Like someone on a diet who can't stop talking about food. Real detachment is mental, not just physical."},
    {"verse": 7, "sanskrit": "यस्त्विन्द्रियाणि मनसा नियम्यारभतेऽर्जुन | कर्मेन्द्रियैः कर्मयोगमसक्तः स विशिष्यते ||", "transliteration": "yas tv indriyāṇi manasā niyamyārabhate 'rjuna | karmendriyaiḥ karma-yogam asaktaḥ sa viśiṣyate", "translation": "But one who controls the senses with the mind and engages in Karma Yoga without attachment is superior.", "modern": "The person who actually controls their mind AND does their work without obsessing over outcomes - that's the winner. Mental discipline PLUS action. Not one or the other."},
    {"verse": 8, "sanskrit": "नियतं कुरु कर्म त्वं कर्म ज्यायो ह्यकर्मणः | शरीरयात्रापि च ते न प्रसिद्ध्येदकर्मणः ||", "transliteration": "niyataṁ kuru karma tvaṁ karma jyāyo hy akarmaṇaḥ | śarīra-yātrāpi ca te na prasiddhyed akarmaṇaḥ", "translation": "Perform your duty, for action is better than inaction. Without action, even maintaining your body would be impossible.", "modern": "Just do your work. Literally. Even basic survival requires action. You need to eat, work, move. Sitting around philosophizing won't pay bills or maintain relationships. Do the thing."},
    {"verse": 9, "sanskrit": "यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबन्धनः | तदर्थं कर्म कौन्तेय मुक्तसङ्गः समाचर ||", "transliteration": "yajñārthāt karmaṇo 'nyatra loko 'yaṁ karma-bandhanaḥ | tad-arthaṁ karma kaunteya mukta-saṅgaḥ samācara", "translation": "Work done as sacrifice is liberating; work done for selfish reasons binds you. Therefore, work without attachment.", "modern": "The WHY matters. Same job, different intention: Working just for money = trapped. Working as service = free. It's not what you do, it's why you do it."},
    {"verse": 10, "sanskrit": "सहयज्ञाः प्रजाः सृष्ट्वा पुरोवाच प्रजापतिः | अनेन प्रसविष्यध्वमेष वोऽस्त्विष्टकामधुक् ||", "transliteration": "saha-yajñāḥ prajāḥ sṛṣṭvā purovāca prajāpatiḥ | anena prasaviṣyadhvam eṣa vo 'stv iṣṭa-kāma-dhuk", "translation": "In the beginning, the Creator created beings along with sacrifice and said: 'By this you shall prosper and it shall fulfill all your desires.'", "modern": "From the start, life was designed as mutual exchange. You give, you receive. Ecosystem. Community. Nobody makes it alone. Your prosperity depends on serving others."},
    {"verse": 11, "sanskrit": "देवान्भावयतानेन ते देवा भावयन्तु वः | परस्परं भावयन्तः श्रेयः परमवाप्स्यथ ||", "transliteration": "devān bhāvayatānena te devā bhāvayantu vaḥ | parasparaṁ bhāvayantaḥ śreyaḥ param avāpsyatha", "translation": "Nourish the gods with sacrifice, and they will nourish you. Thus supporting each other, you will attain the highest good.", "modern": "Reciprocity. Give and take. When you contribute to the system, the system supports you. Community, economy, relationships - all work on mutual exchange. Takers eventually lose everything."},
    {"verse": 12, "sanskrit": "इष्टान्भोगान्हि वो देवा दास्यन्ते यज्ञभाविताः | तैर्दत्तानप्रदायैभ्यो यो भुङ्क्ते स्तेन एव सः ||", "transliteration": "iṣṭān bhogān hi vo devā dāsyante yajña-bhāvitāḥ | tair dattān apradāyaibhyo yo bhuṅkte stena eva saḥ", "translation": "The gods, nourished by sacrifice, will give you desired enjoyments. One who enjoys what is given without offering in return is a thief.", "modern": "Taking without giving = stealing. Using resources without contributing. Consuming without creating. We all know people like this - takers who never reciprocate. Don't be that person."},
    {"verse": 13, "sanskrit": "यज्ञशिष्टाशिनः सन्तो मुच्यन्ते सर्वकिल्बिषैः | भुञ्जते ते त्वघं पापा ये पचन्त्यात्मकारणात् ||", "transliteration": "yajña-śiṣṭāśinaḥ santo mucyante sarva-kilbiṣaiḥ | bhuñjate te tv aghaṁ pāpā ye pacanty ātma-kāraṇāt", "translation": "The righteous who eat what is left from sacrifice are freed from all sins, but those who cook only for themselves eat sin.", "modern": "Sharing what you have = good karma. Hoarding everything for yourself = misery. People who share are happy. People who hoard are anxious. It's that simple."},
    {"verse": 14, "sanskrit": "अन्नाद्भवन्ति भूतानि पर्जन्यादन्नसम्भवः | यज्ञाद्भवति पर्जन्यो यज्ञः कर्मसमुद्भवः ||", "transliteration": "annād bhavanti bhūtāni parjanyād anna-sambhavaḥ | yajñād bhavati parjanyo yajñaḥ karma-samudbhavaḥ", "translation": "Beings are born from food, food from rain, rain from sacrifice, sacrifice from action.", "modern": "Everything is interconnected. Food chain, water cycle, economy, relationships - all linked. Your actions ripple outward. Understanding this makes you more responsible."},
    {"verse": 15, "sanskrit": "कर्म ब्रह्मोद्भवं विद्धि ब्रह्माक्षरसमुद्भवम् | तस्मात्सर्वगतं ब्रह्म नित्यं यज्ञे प्रतिष्ठितम् ||", "transliteration": "karma brahmodbhavaṁ viddhi brahmākṣara-samudbhavam | tasmāt sarva-gataṁ brahma nityaṁ yajñe pratiṣṭhitam", "translation": "Know that action arises from the eternal Brahman. Therefore, the all-pervading Brahman is eternally present in acts of sacrifice.", "modern": "Work itself is sacred. There's divinity in action. You don't need to be in a temple to connect with the sacred - your daily work, done right, IS worship."},
    {"verse": 16, "sanskrit": "एवं प्रवर्तितं चक्रं नानुवर्तयतीह यः | अघायुरिन्द्रियारामो मोघं पार्थ स जीवति ||", "transliteration": "evaṁ pravartitaṁ cakraṁ nānuvartayatīha yaḥ | aghāyur indriyārāmo moghaṁ pārtha sa jīvati", "translation": "One who does not follow this cycle of sacrifice lives in vain, delighting in sense pleasures, their life is useless.", "modern": "People who just take, consume, indulge without contributing are wasting their lives. All pleasure, no purpose. That's a wasted existence."},
    {"verse": 17, "sanskrit": "यस्त्वात्मरतिरेव स्यादात्मतृप्तश्च मानवः | आत्मन्येव च सन्तुष्टस्तस्य कार्यं न विद्यते ||", "transliteration": "yas tv ātma-ratir eva syād ātma-tṛptaś ca mānavaḥ | ātmany eva ca santuṣṭas tasya kāryaṁ na vidyate", "translation": "But for one who delights in the Self, who is satisfied and content in the Self alone, there is no duty.", "modern": "Exception: If you're genuinely self-realized, totally content within, then external duties don't apply. But let's be real - 99.9% of us aren't there. Don't use this as an excuse to be lazy."},
    {"verse": 18, "sanskrit": "नैव तस्य कृतेनार्थो नाकृतेनेह कश्चन | न चास्य सर्वभूतेषु कश्चिदर्थव्यपाश्रयः ||", "transliteration": "naiva tasya kṛtenārtho nākṛteneha kaścana | na cāsya sarva-bhūteṣu kaścid artha-vyapāśrayaḥ", "translation": "For such a person, there is no gain from action done or not done, nor any dependence on others.", "modern": "True masters need nothing from anyone. They're not performing for approval or avoiding action out of fear. Total freedom. But again, most of us aren't there yet."},
    {"verse": 19, "sanskrit": "तस्मादसक्तः सततं कार्यं कर्म समाचर | असक्तो ह्याचरन्कर्म परमाप्नोति पूरुषः ||", "transliteration": "tasmād asaktaḥ satataṁ kāryaṁ karma samācara | asakto hy ācaran karma param āpnoti pūruṣaḥ", "translation": "Therefore, always perform your duty without attachment. Working without attachment, one attains the Supreme.", "modern": "The core teaching: Do your work. Don't be attached to outcomes. This is the path. Work hard, care about quality, then let go of results. That's freedom in action."},
    {"verse": 20, "sanskrit": "कर्मणैव हि संसिद्धिमास्थिता जनकादयः | लोकसंग्रहमेवापि सम्पश्यन्कर्तुमर्हसि ||", "transliteration": "karmaṇaiva hi saṁsiddhim āsthitā janakādayaḥ | loka-saṅgraham evāpi sampaśyan kartum arhasi", "translation": "Kings like Janaka attained perfection through action. You should also perform your duty for the welfare of society.", "modern": "Even legendary kings worked. They didn't retire to caves. They engaged with the world. Your work matters not just for you, but for everyone affected by it."},
    {"verse": 21, "sanskrit": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः | स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते ||", "transliteration": "yad yad ācarati śreṣṭhas tat tad evetaro janaḥ | sa yat pramāṇaṁ kurute lokas tad anuvartate", "translation": "Whatever a great person does, others follow. Whatever standard they set, the world follows.", "modern": "Leaders set the culture. Your actions matter more than your words. People watch what you DO, not what you SAY. If you're a parent, manager, influencer - you're setting the example whether you want to or not."},
    {"verse": 22, "sanskrit": "न मे पार्थास्ति कर्तव्यं त्रिषु लोकेषु किञ्चन | नानवाप्तमवाप्तव्यं वर्त एव च कर्मणि ||", "transliteration": "na me pārthāsti kartavyaṁ triṣu lokeṣu kiñcana | nānavāptam avāptavyaṁ varta eva ca karmaṇi", "translation": "There is nothing in the three worlds that I must do, nor anything unattained to be attained, yet I engage in action.", "modern": "Even God works! Krishna doesn't NEED to do anything, but he still acts. If even the divine engages in action, what excuse do you have to check out?"},
    {"verse": 23, "sanskrit": "यदि ह्यहं न वर्तेयं जातु कर्मण्यतन्द्रितः | मम वर्त्मानुवर्तन्ते मनुष्याः पार्थ सर्वशः ||", "transliteration": "yadi hy ahaṁ na varteyaṁ jātu karmaṇy atandritaḥ | mama vartmānuvartante manuṣyāḥ pārtha sarvaśaḥ", "translation": "If I did not engage in action, people would follow My example everywhere, O Arjuna.", "modern": "Role models can't slack off. If you're in a position where others look up to you, your laziness gives everyone permission to be lazy. Your discipline inspires their discipline."},
    {"verse": 24, "sanskrit": "उत्सीदेयुरिमे लोका न कुर्यां कर्म चेदहम् | सङ्करस्य च कर्ता स्यामुपहन्यामिमाः प्रजाः ||", "transliteration": "utsīdeyur ime lokā na kuryāṁ karma ced aham | saṅkarasya ca kartā syām upahanyām imāḥ prajāḥ", "translation": "If I did not work, these worlds would perish. I would be the cause of chaos and would destroy these beings.", "modern": "If leaders don't lead, systems collapse. If parents don't parent, kids suffer. If workers don't work, society falls apart. Your contribution matters more than you think."},
    {"verse": 25, "sanskrit": "सक्ताः कर्मण्यविद्वांसो यथा कुर्वन्ति भारत | कुर्याद्विद्वांस्तथासक्तश्चिकीर्षुर्लोकसंग्रहम् ||", "transliteration": "saktāḥ karmaṇy avidvāṁso yathā kurvanti bhārata | kuryād vidvāṁs tathāsaktaś cikīrṣur loka-saṅgraham", "translation": "As the ignorant work with attachment, the wise should work without attachment, for the welfare of the world.", "modern": "Most people work for selfish reasons (paycheck, status, recognition). Wise people work for contribution. Same action, different motivation. One leads to burnout, the other to fulfillment."},
    {"verse": 26, "sanskrit": "न बुद्धिभेदं जनयेदज्ञानां कर्मसङ्गिनाम् | जोषयेत्सर्वकर्माणि विद्वान्युक्तः समाचरन् ||", "transliteration": "na buddhi-bhedaṁ janayed ajñānāṁ karma-saṅginām | joṣayet sarva-karmāṇi vidvān yuktaḥ samācaran", "translation": "The wise should not unsettle the minds of the ignorant attached to action. Rather, by performing action in the right spirit, they should inspire others.", "modern": "Don't preach or criticize people who aren't ready. Lead by example. Your actions will inspire more than your lectures ever could. Meet people where they are."},
    {"verse": 27, "sanskrit": "प्रकृतेः क्रियमाणानि गुणैः कर्माणि सर्वशः | अहङ्कारविमूढात्मा कर्ताहमिति मन्यते ||", "transliteration": "prakṛteḥ kriyamāṇāni guṇaiḥ karmāṇi sarvaśaḥ | ahaṅkāra-vimūḍhātmā kartāham iti manyate", "translation": "All actions are performed by nature's qualities. But deluded by ego, one thinks 'I am the doer.'", "modern": "Your ego takes credit for everything. 'I built this!' But you had help, luck, genetics, timing, infrastructure you didn't create. Recognizing this isn't false humility - it's truth. You're part of a much bigger system."},
    {"verse": 28, "sanskrit": "तत्त्ववित्तु महाबाहो गुणकर्मविभागयोः | गुणा गुणेषु वर्तन्त इति मत्वा न सज्जते ||", "transliteration": "tattva-vit tu mahā-bāho guṇa-karma-vibhāgayoḥ | guṇā guṇeṣu vartanta iti matvā na sajjate", "translation": "But one who knows the truth about the modes of nature and their actions does not become attached, knowing that it is nature acting upon nature.", "modern": "When you understand that most of what's happening is just natural forces at play, you don't take everything so personally. You're not that important. Things happen because of complex systems, not because the universe is targeting you."},
    {"verse": 29, "sanskrit": "प्रकृतेर्गुणसम्मूढाः सज्जन्ते गुणकर्मसु | तानकृत्स्नविदो मन्दान्कृत्स्नविन्न विचालयेत् ||", "transliteration": "prakṛter guṇa-sammūḍhāḥ sajjante guṇa-karmasu | tān akṛtsna-vido mandān kṛtsna-vin na vicālayet", "translation": "Those deluded by nature's modes become attached to their activities. The wise should not disturb the minds of those who understand less.", "modern": "Don't try to wake people up forcefully. If someone's not ready for deeper understanding, let them be. Pushing your enlightenment on others just annoys them. They'll get there when they're ready."},
    {"verse": 30, "sanskrit": "मयि सर्वाणि कर्माणि संन्यस्याध्यात्मचेतसा | निराशीर्निर्ममो भूत्वा युध्यस्व विगतज्वरः ||", "transliteration": "mayi sarvāṇi karmāṇi saṁnyasyādhyātma-cetasā | nirāśīr nirmamo bhūtvā yudhyasva vigata-jvaraḥ", "translation": "Dedicating all actions to Me, with mind focused on the Self, free from desire and possessiveness, fight without mental fever.", "modern": "Do your work as an offering to something bigger than yourself. Without expectation of reward. Without claiming ownership of results. Without anxiety. Just do it and release it. That's the path."},
    {"verse": 31, "sanskrit": "ये मे मतमिदं नित्यमनुतिष्ठन्ति मानवाः | श्रद्धावन्तोऽनसूयन्तो मुच्यन्ते तेऽपि कर्मभिः ||", "transliteration": "ye me matam idaṁ nityam anutiṣṭhanti mānavāḥ | śraddhāvanto 'nasūyanto mucyante te 'pi karmabhiḥ", "translation": "Those who regularly follow this teaching with faith and without criticism become free from the bondage of action.", "modern": "If you actually PRACTICE this (work without attachment), you're free. Not from action, but from the stress and anxiety that comes from being obsessed with outcomes. Work becomes effortless."},
    {"verse": 32, "sanskrit": "ये त्वेतदभ्यसूयन्तो नानुतिष्ठन्ति मे मतम् | सर्वज्ञानविमूढांस्तान्विद्धि नष्टानचेतसः ||", "transliteration": "ye tv etad abhyasūyanto nānutiṣṭhanti me matam | sarva-jñāna-vimūḍhāṁs tān viddhi naṣṭān acetasaḥ", "translation": "But those who criticize this teaching and do not follow it are deluded in all knowledge and are lost.", "modern": "People who reject this wisdom out of cynicism or laziness stay stuck. They think they know better, but they're just making excuses. Don't be that person."},
    {"verse": 33, "sanskrit": "सदृशं चेष्टते स्वस्याः प्रकृतेर्ज्ञानवानपि | प्रकृतिं यान्ति भूतानि निग्रहः किं करिष्यति ||", "transliteration": "sadṛśaṁ ceṣṭate svasyāḥ prakṛter jñānavān api | prakṛtiṁ yānti bhūtāni nigrahaḥ kiṁ kariṣyati", "translation": "Even the wise act according to their nature. Beings follow their nature - what can restraint accomplish?", "modern": "You can't fight your basic nature completely. Even enlightened people have personalities, preferences, tendencies. The goal isn't to become a robot. It's to act consciously within your nature, not be a slave to it."},
    {"verse": 34, "sanskrit": "इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ | तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ ||", "transliteration": "indriyasyendriyasyārthe rāga-dveṣau vyavasthitau | tayor na vaśam āgacchet tau hy asya paripanthinau", "translation": "Attraction and aversion are natural for each sense. Do not come under their control, for they are obstacles on the path.", "modern": "You'll naturally like some things and dislike others. That's fine. The problem is when those likes/dislikes control you. Craving what you like, avoiding what you dislike - that's bondage. Observe your preferences without being ruled by them."},
    {"verse": 35, "sanskrit": "श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात् | स्वधर्मे निधनं श्रेयः परधर्मो भयावहः ||", "transliteration": "śreyān sva-dharmo viguṇaḥ para-dharmāt sv-anuṣṭhitāt | sva-dharme nidhanaṁ śreyaḥ para-dharmo bhayāvahaḥ", "translation": "It's better to do your own duty imperfectly than another's duty perfectly. Better to die in your own path than to follow another's, which is dangerous.", "modern": "Be yourself, even if you're messy at it. Don't try to live someone else's life, even if they make it look perfect. Your path is yours. Comparing yourself to others and trying to be them is a recipe for misery. Run your own race."},
    {"verse": 36, "sanskrit": "अर्जुन उवाच | अथ केन प्रयुक्तोऽयं पापं चरति पूरुषः | अनिच्छन्नपि वार्ष्णेय बलादिव नियोजितः ||", "transliteration": "arjuna uvāca | atha kena prayukto 'yaṁ pāpaṁ carati pūruṣaḥ | anicchann api vārṣṇeya balād iva niyojitaḥ", "translation": "Arjuna said: What makes a person commit sin, even unwillingly, as if driven by force?", "modern": "The eternal question: Why do I keep doing things I know I shouldn't? It's like there's a force making me self-sabotage. Eating that, texting that person, buying that thing, saying that comment. We've all been there."},
    {"verse": 37, "sanskrit": "श्रीभगवानुवाच | काम एष क्रोध एष रजोगुणसमुद्भवः | महाशनो महापाप्मा विद्ध्येनमिह वैरिणम् ||", "transliteration": "śrī-bhagavān uvāca | kāma eṣa krodha eṣa rajo-guṇa-samudbhavaḥ | mahāśano mahā-pāpmā viddhy enam iha vairiṇam", "translation": "The Lord said: It is desire and anger, born of passion. Know this as the enemy - insatiable and sinful.", "modern": "Desire and anger are what mess you up. You WANT something and when you don't get it, you get MAD. That combo of wanting + frustration = doing dumb stuff. Recognize these two as the enemy. They hijack your rational mind."},
    {"verse": 38, "sanskrit": "धूमेनाव्रियते वह्निर्यथादर्शो मलेन च | यथोल्बेनावृतो गर्भस्तथा तेनेदमावृतम् ||", "transliteration": "dhūmenāvriyate vahnir yathādarśo malena ca | yatholbenāvṛto garbhas tathā tenedam āvṛtam", "translation": "As fire is covered by smoke, a mirror by dust, an embryo by the womb, knowledge is covered by desire.", "modern": "Desire clouds your judgment like smoke covering fire. You can't see clearly when you want something badly. Your rational mind gets covered by craving. That's why you make terrible decisions when you're horny, hungry, angry, or greedy."},
    {"verse": 39, "sanskrit": "आवृतं ज्ञानमेतेन ज्ञानिनो नित्यवैरिणा | कामरूपेण कौन्तेय दुष्पूरेणानलेन च ||", "transliteration": "āvṛtaṁ jñānam etena jñānino nitya-vairiṇā | kāma-rūpeṇa kaunteya duṣpūreṇānalena ca", "translation": "Knowledge is covered by desire, the eternal enemy of the wise, which is insatiable like fire.", "modern": "Desire is never satisfied. You get what you want, then you want something else. It's a fire that keeps burning. More money, more food, more sex, more validation - it never ends. That's why it's the enemy."},
    {"verse": 40, "sanskrit": "इन्द्रियाणि मनो बुद्धिरस्याधिष्ठानमुच्यते | एतैर्विमोहयत्येष ज्ञानमावृत्य देहिनम् ||", "transliteration": "indriyāṇi mano buddhir asyādhiṣṭhānam ucyate | etair vimohayaty eṣa jñānam āvṛtya dehinam", "translation": "The senses, mind, and intellect are said to be its seat. Through these it deludes the embodied soul, covering knowledge.", "modern": "Desire works through your senses, mind, and even your intellect. It's not just physical cravings - your smart brain will rationalize why you 'need' that thing you want. You'll make logical-sounding arguments for irrational desires."},
    {"verse": 41, "sanskrit": "तस्मात्त्वमिन्द्रियाण्यादौ नियम्य भरतर्षभ | पाप्मानं प्रजहि ह्येनं ज्ञानविज्ञाननाशनम् ||", "transliteration": "tasmāt tvam indriyāṇy ādau niyamya bharatarṣabha | pāpmānaṁ prajahi hy enaṁ jñāna-vijñāna-nāśanam", "translation": "Therefore, first control the senses and slay this sinful enemy, the destroyer of knowledge and realization.", "modern": "Control your senses first. Don't let every craving dictate your actions. That's the starting point. You can't think clearly when your senses are running wild. Discipline comes before understanding."},
    {"verse": 42, "sanskrit": "इन्द्रियाणि पराण्याहुरिन्द्रियेभ्यः परं मनः | मनसस्तु परा बुद्धिर्यो बुद्धेः परतस्तु सः ||", "transliteration": "indriyāṇi parāṇy āhur indriyebhyaḥ paraṁ manaḥ | manasas tu parā buddhir yo buddheḥ paratas tu saḥ", "translation": "The senses are superior to the body, mind is superior to senses, intellect is superior to mind, and the soul is superior to intellect.", "modern": "Hierarchy of consciousness: Your body is the lowest level. Your senses are above that. Your thinking mind is above your senses. Your rational intellect is above your emotional mind. And your true self is above all of that. Most people live at the bottom levels. Level up."},
    {"verse": 43, "sanskrit": "एवं बुद्धेः परं बुद्ध्वा संस्तभ्यात्मानमात्मना | जहि शत्रुं महाबाहो कामरूपं दुरासदम् ||", "transliteration": "evaṁ buddheḥ paraṁ buddhvā saṁstabhyātmānam ātmanā | jahi śatruṁ mahā-bāho kāma-rūpaṁ durāsadam", "translation": "Thus knowing yourself to be beyond the intellect, steady the mind by the Self and conquer this formidable enemy in the form of desire.", "modern": "Use your highest self to control your lowest self. When desire pulls you, engage your wisdom. 'Do I actually need this or is it just craving?' Pause. Breathe. Let your wise self make the decision, not your impulsive self. That's self-mastery."}
  ]
}
