{
  "number": 2,
  "title": "The Path of Knowledge",
  "sanskrit": "рд╕рд╛рдВрдЦреНрдпрдпреЛрдЧ",
  "verses": 72,
  "introduction": "In this chapter, Krishna teaches Arjuna about the eternal nature of the soul and introduces the fundamental concepts of yoga and selfless action. This is where the real teaching begins.",
  "shlokas": [
    {
      "verse": 1,
      "sanskrit": "рд╕рдЮреНрдЬрдп рдЙрд╡рд╛рдЪ |\nрддрдВ рддрдерд╛ рдХреГрдкрдпрд╛рд╡рд┐рд╖реНрдЯрдорд╢реНрд░реБрдкреВрд░реНрдгрд╛рдХреБрд▓реЗрдХреНрд╖рдгрдореН |\nрд╡рд┐рд╖реАрджрдиреНрддрдорд┐рджрдВ рд╡рд╛рдХреНрдпрдореБрд╡рд╛рдЪ рдордзреБрд╕реВрджрдирдГ ||",
      "transliteration": "sa├▒jaya uv─Бca\ntaс╣Б tath─Б kс╣Ыpay─Бviс╣гс╣нam a┼Ыru-p┼лrс╣З─Бkulekс╣гaс╣Зam\nviс╣г─лdantam idaс╣Б v─Бkyam uv─Бca madhus┼лdanaс╕е",
      "translation": "Sanjaya said: Seeing Arjuna full of compassion, his mind depressed, his eyes full of tears, Krishna spoke these words.",
      "modern": "Think of this like your best friend finding you crying over a tough decision. Maybe you're torn between your dream job and taking care of family. Or choosing between what's expected of you and what feels right. That's Arjuna right now - completely overwhelmed. And Krishna? He's about to drop some serious wisdom. This is that moment when your mentor says 'Let's talk' when you need it most."
    },
    {
      "verse": 2,
      "sanskrit": "рд╢реНрд░реАрднрдЧрд╡рд╛рдиреБрд╡рд╛рдЪ |\nрдХреБрддрд╕реНрддреНрд╡рд╛ рдХрд╢реНрдорд▓рдорд┐рджрдВ рд╡рд┐рд╖рдореЗ рд╕рдореБрдкрд╕реНрдерд┐рддрдореН |\nрдЕрдирд╛рд░реНрдпрдЬреБрд╖реНрдЯрдорд╕реНрд╡рд░реНрдЧреНрдпрдордХреАрд░реНрддрд┐рдХрд░рдорд░реНрдЬреБрди ||",
      "transliteration": "┼Ыr─л-bhagav─Бn uv─Бca\nkutas tv─Б ka┼Ыmalam idaс╣Б viс╣гame samupasthitam\nan─Бrya-juс╣гс╣нam asvargyam ak─лrti-karam arjuna",
      "translation": "The Supreme Lord said: My dear Arjuna, how have these impurities come upon you? They are not at all befitting a person who knows the value of life. They lead not to higher planets but to infamy.",
      "modern": "Krishna's basically saying: 'Dude, why are you spiraling right now?' It's like when you're about to give a big presentation or take an exam, and suddenly you're like 'I can't do this.' Krishna's not being harsh - he's challenging Arjuna (and us) to think: Is this fear really who you are? Or is it just your anxiety talking? Sometimes we need that push to recognize when we're letting fear drive the bus instead of our true self."
    },
    {
      "verse": 3,
      "sanskrit": "рдХреНрд▓реИрдмреНрдпрдВ рдорд╛ рд╕реНрдо рдЧрдордГ рдкрд╛рд░реНрде рдиреИрддрддреНрддреНрд╡рдпреНрдпреБрдкрдкрджреНрдпрддреЗ |\nрдХреНрд╖реБрджреНрд░рдВ рд╣реГрджрдпрджреМрд░реНрдмрд▓реНрдпрдВ рддреНрдпрдХреНрддреНрд╡реЛрддреНрддрд┐рд╖реНрда рдкрд░рдиреНрддрдк ||",
      "transliteration": "klaibyaс╣Б m─Б sma gamaс╕е p─Бrtha naitat tvayy upapadyate\nkс╣гudraс╣Б hс╣Ыdaya-daurbalyaс╣Б tyaktvottiс╣гс╣нha parantapa",
      "translation": "Do not yield to this degrading impotence. It does not become you. Give up such petty weakness of heart and arise, O chastiser of the enemy.",
      "modern": "This hits different when you think about all the times we tell ourselves we're not good enough. Failed a test? 'I'm stupid.' Got rejected? 'I'm unlovable.' Lost your job? 'I'm worthless.' Krishna's telling Arjuna (and us): Stop with the self-defeating narrative. You're bigger than this moment. That voice in your head that says you can't? That's not the real you. Get up. Keep going. You've got this."
    },
    {
      "verse": 11,
      "sanskrit": "рд╢реНрд░реАрднрдЧрд╡рд╛рдиреБрд╡рд╛рдЪ |\nрдЕрд╢реЛрдЪреНрдпрд╛рдирдиреНрд╡рд╢реЛрдЪрд╕реНрддреНрд╡рдВ рдкреНрд░рдЬреНрдЮрд╛рд╡рд╛рджрд╛рдВрд╢реНрдЪ рднрд╛рд╖рд╕реЗ |\nрдЧрддрд╛рд╕реВрдирдЧрддрд╛рд╕реВрдВрд╢реНрдЪ рдирд╛рдиреБрд╢реЛрдЪрдиреНрддрд┐ рдкрдгреНрдбрд┐рддрд╛рдГ ||",
      "transliteration": "┼Ыr─л-bhagav─Бn uv─Бca\na┼Ыocy─Бn anva┼Ыocas tvaс╣Б praj├▒─Б-v─Бd─Бс╣Б┼Ы ca bh─Бс╣гase\ngat─Бs┼лn agat─Бs┼лс╣Б┼Ы ca n─Бnu┼Ыocanti paс╣Зс╕Нit─Бс╕е",
      "translation": "The Supreme Personality of Godhead said: While speaking learned words, you are mourning for what is not worthy of grief. Those who are wise lament neither for the living nor for the dead.",
      "modern": "Here's where Krishna drops the mic. You're worried about all the wrong things. We spend so much energy stressing about stuff that, in the grand scheme, doesn't really matter. That Instagram post that didn't get enough likes? That embarrassing thing you said three years ago that you still think about at 3 AM? The wise ones don't sweat that stuff. They're focused on what actually moves the needle in life - growth, purpose, real connection. Stop mourning things that were never meant to last forever anyway."
    },
    {
      "verse": 12,
      "sanskrit": "рди рддреНрд╡реЗрд╡рд╛рд╣рдВ рдЬрд╛рддреБ рдирд╛рд╕рдВ рди рддреНрд╡рдВ рдиреЗрдореЗ рдЬрдирд╛рдзрд┐рдкрд╛рдГ |\nрди рдЪреИрд╡ рди рднрд╡рд┐рд╖реНрдпрд╛рдордГ рд╕рд░реНрд╡реЗ рд╡рдпрдорддрдГ рдкрд░рдореН ||",
      "transliteration": "na tv ev─Бhaс╣Б j─Бtu n─Бsaс╣Б na tvaс╣Б neme jan─Бdhip─Бс╕е\nna caiva na bhaviс╣гy─Бmaс╕е sarve vayam ataс╕е param",
      "translation": "Never was there a time when I did not exist, nor you, nor all these kings; nor in the future shall any of us cease to be.",
      "modern": "Mind. Blown. ЁЯдп You've always existed and you always will. Not your body, not your Instagram profile - but the real YOU. That consciousness, that awareness, that spark - it's eternal. Before you were born, you existed. After you die, you'll still exist. This isn't some woo-woo stuff - think about it: energy can't be created or destroyed, just transformed. You're not your job title, your relationship status, or your GPA. You're something way deeper, way more permanent. That's actually comforting when you're going through changes."
    },
    {
      "verse": 13,
      "sanskrit": "рджреЗрд╣рд┐рдиреЛрд╜рд╕реНрдорд┐рдиреНрдпрдерд╛ рджреЗрд╣реЗ рдХреМрдорд╛рд░рдВ рдпреМрд╡рдирдВ рдЬрд░рд╛ |\nрддрдерд╛ рджреЗрд╣рд╛рдиреНрддрд░рдкреНрд░рд╛рдкреНрддрд┐рд░реНрдзреАрд░рд╕реНрддрддреНрд░ рди рдореБрд╣реНрдпрддрд┐ ||",
      "transliteration": "dehino 'smin yath─Б dehe kaum─Бraс╣Б yauvanaс╣Б jar─Б\ntath─Б deh─Бntara-pr─Бptir dh─лras tatra na muhyati",
      "translation": "As the embodied soul continuously passes, in this body, from boyhood to youth to old age, the soul similarly passes into another body at death. A sober person is not bewildered by such a change.",
      "modern": "Remember looking at your middle school photos and cringing? That's not you anymore. Neither is the toddler version, or the version from last year. Your body and mind keep changing, but there's something in you that's always been you - that observer, that awareness. Death is just another wardrobe change. Your body gets old and worn out like your favorite hoodie, so you get a new one. The real you? Still there. This actually takes the fear out of aging and dying when you realize you're not the container, you're what's inside."
    },
    {
      "verse": 20,
      "sanskrit": "рди рдЬрд╛рдпрддреЗ рдореНрд░рд┐рдпрддреЗ рд╡рд╛ рдХрджрд╛рдЪрд┐рдиреНрдирд╛рдпрдВ рднреВрддреНрд╡рд╛ рднрд╡рд┐рддрд╛ рд╡рд╛ рди рднреВрдпрдГ |\nрдЕрдЬреЛ рдирд┐рддреНрдпрдГ рд╢рд╛рд╢реНрд╡рддреЛрд╜рдпрдВ рдкреБрд░рд╛рдгреЛ рди рд╣рдиреНрдпрддреЗ рд╣рдиреНрдпрдорд╛рдиреЗ рд╢рд░реАрд░реЗ ||",
      "transliteration": "na j─Бyate mriyate v─Б kad─Бcin n─Бyaс╣Б bh┼лtv─Б bhavit─Б v─Б na bh┼лyaс╕е\najo nityaс╕е ┼Ы─Б┼Ыvato 'yaс╣Б pur─Бс╣Зo na hanyate hanyam─Бne ┼Ыar─лre",
      "translation": "For the soul there is neither birth nor death at any time. He has not come into being, does not come into being, and will not come into being. He is unborn, eternal, ever-existing and primeval. He is not slain when the body is slain.",
      "modern": "You can't be destroyed. Period. All your existential anxiety? Based on a misunderstanding. You think you're this fragile thing that can be broken, but you're actually indestructible. When your body gets wrecked - and it will eventually - the real you is totally fine. It's like worrying your car is totaled when you're safe inside. This is probably the most freeing truth in the entire Gita. Once you really get this, a lot of your fears just... dissolve. You're literally eternal. How cool is that?"
    },
    {
      "verse": 22,
      "sanskrit": "рд╡рд╛рд╕рд╛рдВрд╕рд┐ рдЬреАрд░реНрдгрд╛рдирд┐ рдпрдерд╛ рд╡рд┐рд╣рд╛рдп рдирд╡рд╛рдирд┐ рдЧреГрд╣реНрдгрд╛рддрд┐ рдирд░реЛрд╜рдкрд░рд╛рдгрд┐ |\nрддрдерд╛ рд╢рд░реАрд░рд╛рдгрд┐ рд╡рд┐рд╣рд╛рдп рдЬреАрд░реНрдгрд╛рдиреНрдпрдиреНрдпрд╛рдирд┐ рд╕рдВрдпрд╛рддрд┐ рдирд╡рд╛рдирд┐ рджреЗрд╣реА ||",
      "transliteration": "v─Бs─Бс╣Бsi j─лrс╣З─Бni yath─Б vih─Бya nav─Бni gс╣Ыhс╣З─Бti naro 'par─Бс╣Зi\ntath─Б ┼Ыar─лr─Бс╣Зi vih─Бya j─лrс╣З─Бny any─Бni saс╣Бy─Бti nav─Бni deh─л",
      "translation": "As a person puts on new garments, giving up old ones, the soul similarly accepts new material bodies, giving up the old and useless ones.",
      "modern": "Best analogy ever. You don't cry when you throw away old, torn clothes and get new ones, right? That's death. Your soul is like 'These jeans are ripped beyond repair, time for a fresh fit.' We get so attached to this particular body, this life, these circumstances - but it's all temporary anyway. Everything you're stressed about keeping? You're gonna leave it all behind one day. So maybe chill a bit about the material stuff and focus on leveling up your actual self - your character, wisdom, and inner peace. That's what carries over."
    },
    {
      "verse": 27,
      "sanskrit": "рдЬрд╛рддрд╕реНрдп рд╣рд┐ рдзреНрд░реБрд╡реЛ рдореГрддреНрдпреБрд░реНрдзреНрд░реБрд╡рдВ рдЬрдиреНрдо рдореГрддрд╕реНрдп рдЪ |\nрддрд╕реНрдорд╛рджрдкрд░рд┐рд╣рд╛рд░реНрдпреЗрд╜рд░реНрдереЗ рди рддреНрд╡рдВ рд╢реЛрдЪрд┐рддреБрдорд░реНрд╣рд╕рд┐ ||",
      "transliteration": "j─Бtasya hi dhruvo mс╣Ыtyur dhruvaс╣Б janma mс╣Ыtasya ca\ntasm─Бd aparih─Бrye 'rthe na tvaс╣Б ┼Ыocitum arhasi",
      "translation": "One who has taken his birth is sure to die, and after death one is sure to take birth again. Therefore, in the unavoidable discharge of your duty, you should not lament.",
      "modern": "Real talk: Everyone dies. 100% guaranteed. No exceptions. And guess what? That makes it not a big deal. It's like stressing about whether the sun will rise tomorrow - it's just what happens. So stop treating death like this huge scary monster. It's just part of the cycle. Born тЖТ Live тЖТ Die тЖТ Repeat. What IS worth worrying about? How you live. Are you doing what you're supposed to be doing? Are you showing up for your life? Focus on that, not on the inevitable end. Live so fully that when it's time to go, you have zero regrets."
    },
    {
      "verse": 47,
      "sanskrit": "рдХрд░реНрдордгреНрдпреЗрд╡рд╛рдзрд┐рдХрд╛рд░рд╕реНрддреЗ рдорд╛ рдлрд▓реЗрд╖реБ рдХрджрд╛рдЪрди |\nрдорд╛ рдХрд░реНрдордлрд▓рд╣реЗрддреБрд░реНрднреВрд░реНрдорд╛ рддреЗ рд╕рдЩреНрдЧреЛрд╜рд╕реНрддреНрд╡рдХрд░реНрдордгрд┐ ||",
      "transliteration": "karmaс╣Зy ev─Бdhik─Бras te m─Б phaleс╣гu kad─Бcana\nm─Б karma-phala-hetur bh┼лr m─Б te saс╣Еgo 'stv akarmaс╣Зi",
      "translation": "You have a right to perform your prescribed duty, but you are not entitled to the fruits of action. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.",
      "modern": "THIS is the verse everyone quotes, and for good reason. Do your thing, but don't obsess over the outcome. Study hard, but don't tie your self-worth to your grades. Apply for jobs, but don't spiral if you get rejected. Post your art, but don't let likes define you. Focus on what you can control - your effort, your intentions, your process. The results? Not actually in your hands. This isn't about not caring - it's about caring about the right things. When you detach from outcomes, you're free to do your best work without the paralyzing fear of failure. That's where magic happens."
    },
    {
      "verse": 48,
      "sanskrit": "рдпреЛрдЧрд╕реНрдердГ рдХреБрд░реБ рдХрд░реНрдорд╛рдгрд┐ рд╕рдЩреНрдЧрдВ рддреНрдпрдХреНрддреНрд╡рд╛ рдзрдирдЮреНрдЬрдп |\nрд╕рд┐рджреНрдзреНрдпрд╕рд┐рджреНрдзреНрдпреЛрдГ рд╕рдореЛ рднреВрддреНрд╡рд╛ рд╕рдорддреНрд╡рдВ рдпреЛрдЧ рдЙрдЪреНрдпрддреЗ ||",
      "transliteration": "yoga-sthaс╕е kuru karm─Бс╣Зi saс╣Еgaс╣Б tyaktv─Б dhana├▒jaya\nsiddhy-asiddhyoс╕е samo bh┼лtv─Б samatvaс╣Б yoga ucyate",
      "translation": "Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such equanimity is called yoga.",
      "modern": "The secret to not burning out? This right here. Stay balanced whether you win or lose. Got into your dream school? Cool. Didn't? Also cool. You're still you either way. This doesn't mean be apathetic - it means don't let external results wreck your internal peace. Social media makes this SO hard because we're constantly comparing. But real strength is when you can post something that flops and not spiral, or when something goes viral and not let it inflate your ego. Success and failure are both just data points. Your worth is constant. That's real yoga - mental and emotional stability regardless of circumstances."
    },
    {
      "verse": 56,
      "sanskrit": "рджреБрдГрдЦреЗрд╖реНрд╡рдиреБрджреНрд╡рд┐рдЧреНрдирдордирд╛рдГ рд╕реБрдЦреЗрд╖реБ рд╡рд┐рдЧрддрд╕реНрдкреГрд╣рдГ |\nрд╡реАрддрд░рд╛рдЧрднрдпрдХреНрд░реЛрдзрдГ рд╕реНрдерд┐рддрдзреАрд░реНрдореБрдирд┐рд░реБрдЪреНрдпрддреЗ ||",
      "transliteration": "duс╕еkheс╣гv anudvigna-man─Бс╕е sukheс╣гu vigata-spс╣Ыhaс╕е\nv─лta-r─Бga-bhaya-krodhaс╕е sthita-dh─лr munir ucyate",
      "translation": "One who is not disturbed in mind even amidst the threefold miseries or elated when there is happiness, and who is free from attachment, fear and anger, is called a sage of steady mind.",
      "modern": "Goals. This is literally describing the most mentally healthy person ever. Anxiety doesn't own them. Drama doesn't phase them. They're not addicted to highs or crushed by lows. They just... are. In a world of constant emotional whiplash (thanks, social media and news cycles), this is the ultimate flex. Not being numb - being stable. Not being cold - being free. Imagine scrolling through your feed and not feeling triggered by literally anything. Someone doing better than you? You're genuinely happy for them. Someone talking trash? Doesn't even register. That's the level of inner peace we should all be working toward."
    },
    {
      "verse": 62,
      "sanskrit": "рдзреНрдпрд╛рдпрддреЛ рд╡рд┐рд╖рдпрд╛рдиреНрдкреБрдВрд╕рдГ рд╕рдЩреНрдЧрд╕реНрддреЗрд╖реВрдкрдЬрд╛рдпрддреЗ |\nрд╕рдЩреНрдЧрд╛рддреНрд╕рдЮреНрдЬрд╛рдпрддреЗ рдХрд╛рдордГ рдХрд╛рдорд╛рддреНрдХреНрд░реЛрдзреЛрд╜рднрд┐рдЬрд╛рдпрддреЗ ||",
      "transliteration": "dhy─Бyato viс╣гay─Бn puс╣Бsaс╕е saс╣Еgas teс╣г┼лpaj─Бyate\nsaс╣Еg─Бt sa├▒j─Бyate k─Бmaс╕е k─Бm─Бt krodho 'bhij─Бyate",
      "translation": "While contemplating the objects of the senses, a person develops attachment for them, and from such attachment lust develops, and from lust anger arises.",
      "modern": "The downward spiral, explained. You see something you want тЖТ You can't stop thinking about it тЖТ You NEED it тЖТ You're pissed when you can't get it. This is literally every consumer ad ever, and it's how social media algorithms keep you hooked. You see someone's perfect life тЖТ You want that тЖТ You become obsessed тЖТ You get bitter when your life doesn't measure up. Krishna diagnosed our dopamine-addiction culture 5,000 years ago. The way out? Stop obsessively thinking about what you don't have. Easier said than done, but awareness is the first step."
    },
    {
      "verse": 63,
      "sanskrit": "рдХреНрд░реЛрдзрд╛рджреНрднрд╡рддрд┐ рд╕рдореНрдореЛрд╣рдГ рд╕рдореНрдореЛрд╣рд╛рддреНрд╕реНрдореГрддрд┐рд╡рд┐рднреНрд░рдордГ |\nрд╕реНрдореГрддрд┐рднреНрд░рдВрд╢рд╛рджреН рдмреБрджреНрдзрд┐рдирд╛рд╢реЛ рдмреБрджреНрдзрд┐рдирд╛рд╢рд╛рддреНрдкреНрд░рдгрд╢реНрдпрддрд┐ ||",
      "transliteration": "krodh─Бd bhavati sammohaс╕е sammoh─Бt smс╣Ыti-vibhramaс╕е\nsmс╣Ыti-bhraс╣Б┼Ы─Бd buddhi-n─Б┼Ыo buddhi-n─Б┼Ы─Бt praс╣Зa┼Ыyati",
      "translation": "From anger, complete delusion arises, and from delusion bewilderment of memory. When memory is bewildered, intelligence is lost, and when intelligence is lost one falls down again into the material pool.",
      "modern": "Ever send a text you regret when you're mad? That's this. Anger тЖТ You lose perspective тЖТ You forget who you are and what matters тЖТ You do something stupid тЖТ Your life gets worse. We've all been there. The guy who loses his cool in a meeting and torpedoes his career. The person who blows up a good relationship over something minor. The protester who gets arrested and ruins future job prospects. When you're angry, your IQ drops like 50 points. So the move? Pause. Breathe. Don't let anger hijack your brain. Future you will be grateful."
    },
    {
      "verse": 71,
      "sanskrit": "рд╡рд┐рд╣рд╛рдп рдХрд╛рдорд╛рдиреНрдпрдГ рд╕рд░реНрд╡рд╛рдиреНрдкреБрдорд╛рдВрд╢реНрдЪрд░рддрд┐ рдирд┐рдГрд╕реНрдкреГрд╣рдГ |\nрдирд┐рд░реНрдордореЛ рдирд┐рд░рд╣рдЩреНрдХрд╛рд░рдГ рд╕ рд╢рд╛рдиреНрддрд┐рдордзрд┐рдЧрдЪреНрдЫрддрд┐ ||",
      "transliteration": "vih─Бya k─Бm─Бn yaс╕е sarv─Бn pum─Бс╣Б┼Ы carati niс╕еspс╣Ыhaс╕е\nnirmamo nirahaс╣Еk─Бraс╕е sa ┼Ы─Бntim adhigacchati",
      "translation": "A person who has given up all desires for sense gratification, who lives free from desires, who has given up all sense of proprietorship and is devoid of false egoтАФhe alone can attain real peace.",
      "modern": "The ultimate anti-consumerism message. Real peace comes when you stop needing stuff to feel complete. Not because you're broke and pretending you don't want things - but because you genuinely realize that external stuff can't fill internal voids. No possessiveness ('this is mine'). No ego ('I'm special'). Just... being. This is what every minimalist influencer is trying to explain but usually just ends up bragging about their aesthetically pleasing emptiness. Real contentment is when you could have everything or nothing and be equally at peace. That's freedom. That's the goal."
    }
  ]
}
